[{"id":"1162430580063994029","channel_id":"1161807514006978621","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Finally, there is the Guildmaster, whose Rank is claimed by a Master with the highest approval upon the passing or exit of the previous Guildmaster.","timestamp":"2023-10-13T16:44:07.203000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"birdsie"},{"id":"1162430505543794809","channel_id":"1161807514006978621","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Masterhood within the Guild is conferred at the Guildmaster's pleasure, and often granted for exceptional feats or long and dutiful service, or extreme advancement with one's magics or inherent powers. A Master should be, at minimum, capable of defeating a small platoon of Royal Knights or holding even with a mature dragon without dying, although most of them are more powerful. \n\nMost of the Masters currently in the Guild have been with it for decades, if not centuries, and are well-recognized names in Albion and beyond: celebrities spoken of with hushed voices, in folk tale and local legend, even though these august figures do in fact exist. The Guild affords more of its prestigious resources to Masters and ensuring their comfort and safety. \n\nAmong them are the colloquially-named, \"Old Monsters In Reserve,\" such as Faust Windfallow or the Mana Entity James, whom the Guild calls upon in truly dire circumstances.","timestamp":"2023-10-13T16:43:49.436000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"birdsie"},{"id":"1162429647972212826","channel_id":"1161807514006978621","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**RANKS in the Guild of Heroes**\n\nGuildmaster\nMaster\nHero\nApprentice\nNovice \n\n---\n\nAll new recruits are Novices, although exceptional skill or pre-existing knowledge sufficient to perform useful tasks on par with a professional adventurer or clerk of some domain can immediately elevate them to Apprentice with a Master's permission; elevating a new recruit of the Guild to Rank of Hero is also possible, but requires the Guildmaster himself to sign off on it.\n\nIn more common situations, a Novice is an individual still in-training, and not trusted to take on any except the most safe and innocuous missions: finding a lost cat, mapping a cave otherwise confirmed to be safe, and similar levels of task. Even then, they'll often by accompanied by an Apprentice or Hero, if one is available, only going alone if resources are stretched. Often, Novices are made to train under a Master or Hero and expand on whatever talents drew the Guild's eye and made them reach out for recruitment\n\nApprentices are entrusted with more responsibilities: deemed able to handle common threats, such as an individual unenhanced bandit, a wild animal, or a singular monster of unimpressive proportions. Often, Apprentices will study under a Hero or (more rarely) a Master in small teams of one to three individuals. Often, advancement from Apprentice to Hero takes about three to five years, and can be approved by a Master if they have been an Apprentice for at least three years.\n\nA Hero is what the Guild considers a 'fully mature and trained' member of its ranks, a fully-fleged member of the Guild. Here come a number of new duties: maintaining stringent paperwork of one's missions, aiding the Guild in training new Apprentices, passing on their skills, and completing more dangerous missions. A Hero is expected of being at least a rough match for a Royal Knight of Albion in terms of raw combat power, even if their true specialty lies in something else, such as logistics or engineering.","timestamp":"2023-10-13T16:40:24.975000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"birdsie"},{"id":"1161808923825799239","channel_id":"1161807514006978621","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"```**BASIC INFORMATION**\n**Name**: \n**Aliases**: \n**Age**: \n**Gender**:\n**Race*:\n\n**PERSONAL**\n**Sexuality**: (Ships gotta sail, then sink each other.)\n**High Concept**: (Sum up your character in a sentence.)\n**Backstory**: (At least a solid paragraph. Keep it relevant.)\n**Affiliations**: (Organizations or individuals your character is associated with.)\n**Guild Rank**: (Remove if not applicable.)\n\n**PHYSICAL**\n**Appearance**: (Written, or a picture. If written, then at least a detailed paragraph of text.)\n**Weapons & Armor**: \n**Items & Personal Belongings**:\n**Skills & Abilities**: \n**Spells & Magic**:\n**Weaknesses**: \n**Other**:\n\n**FLUFF** (Optional)\n**Hobbies**: (What does the dark lord do in his free time, when not vying for supremacy over the world?)\n**Quote\\s**: (Notable things that the character has said, that may show off their personality or speech.)\n**Theme**: (Musical theme.)\n```\n\nNon-Discord variant (without bolds):\n\n```BASIC INFORMATION\nName: \nAliases: \nAge: \nGender:\nRace:\n\nPERSONAL\nSexuality: (Ships gotta sail, then sink each other.)\nHigh Concept: (Sum up your character in a sentence.)\nBackstory: (At least a solid paragraph. Keep it relevant.)\nAffiliations: (Organizations or individuals your character is associated with.)\nGuild Rank: (Remove if not applicable.)\n\nPHYSICAL\nAppearance: (Written, or a picture. If written, then at least a detailed paragraph of text.)\nWeapons & Armor: \nItems & Personal Belongings:\nSkills & Abilities: \nSpells & Magic:\nWeaknesses: \nOther:\n\nFLUFF (Optional)\nHobbies: (What does the dark lord do in his free time, when not vying for supremacy over the world?)\nQuote\\s: (Notable things that the character has said, that may show off their personality or speech.)\nTheme: (Musical theme.)```","timestamp":"2023-10-11T23:33:52.806000+00:00","edited_timestamp":"2023-10-13T17:48:16.676000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"birdsie"}]