[{"id":"1164361450102456401","channel_id":"1163197898532606094","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The Raven's Arcana","timestamp":"2023-10-19T00:36:42.494000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1164361450102456401","guild_id":"796570401681309696"},"flags":32,"thread":{"id":"1164361450102456401","type":11,"last_message_id":"1164361584588636220","flags":0,"guild_id":"796570401681309696","name":"The Raven's Arcana","parent_id":"1163197898532606094","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"282635253875736576","thread_metadata":{"archived":true,"archive_timestamp":"2023-11-18T00:44:12.245000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2023-10-19T00:36:42.494000+00:00"},"message_count":5,"member_count":3,"total_message_sent":5,"member_ids_preview":["214058147499868160","282635253875736576","340862894998683658"]},"components":[],"position":0,"userName":"losthaven"},{"id":"1164361454166741022","channel_id":"1164361450102456401","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Rap. Tap. Tap.** \n\nEchoing along endless rows of bookshelves, so colossal in height that they extended far into the distant, roofless abyss that was the Raven’s Arcana ceiling, a bored lich tapped away at his desk, bony fingers grinding away as he tapped away with ever increasing aggravation.\n\n***Rap. Tap. Tap.***\n\n***RAP TAP TAPTAPTAPTAPTAPTAPTAP-***\n\n“**FUUUUUUUUUUUUUUUUUUUUUUUUUUCK-**” Without warning, his pent up irritation explodes, all of it culminating into an eardrum-shattering scream that reverberates through the very floorboards of the store, permeating through the air particles with such force that even the merchandise, stacked haphazardly onto the impossibly tall shelves begin to rattle, threatening to topple over and bury the lich under a mountain of random assorted, accursed wares.","timestamp":"2023-10-19T00:36:43.463000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"losthaven"},{"id":"1164361475209572442","channel_id":"1164361450102456401","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"What follows his shrill scream was but a brief moment of silence before like a petulant child, deciding that he had yet to inflict enough mayhem, Faust grips the underside of his desk with such incredible force that it should never, not in a thousand lifetimes, belong to a perma-virgin wizard who had never heard of touching grass in their entire life, and flips the desk at least twelve feet into the air. Pens, paperwork and trinkets fly all across, with the desk completing at least six spins in its airtime before crashing down onto the poor floorboards, lodging itself firmly into the ground and sending splinters of wood flying in all directions, flinging outward with enough lethal force to convict Faust of manslaughter should an unfortunate soul happen to be standing at the wrong place and at the wrong time. \n\nThis time, the chaos finally rouses somebody’s attention as a young woman donning a mask of similar make to Faust emerges from behind the forest of shelves. The lich’s shop assistant only eyes the untold destruction her boss had inflicted unto the floorboards with keen disinterest, before calmly averting her gaze from the murder scene and back toward the store’s very irate shopkeep. “What appears to be the issue?” Emily inquires, though completely apathetic to whatever ridiculous plight the old, schizophrenic lich would be suffering.","timestamp":"2023-10-19T00:36:48.480000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"losthaven"},{"id":"1164361520550002728","channel_id":"1164361450102456401","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"“HOW HAVE WE NOT HAD A SINGLE CUSTOMER IN SIX WEEKS?!” Another screech escapes the lich’s non-existent vocal cords. Such a sound that only a banshee could make prompts Emily to plug her ears with her fingers. \n\n“With all due respect, I believe the Blind Eternities was less than an ideal place to set up shop,” the store assistant points out blankly, removing her fingers from her ears only once she could be completely sure that this bipolar lich had ceased his incessant screeching.\n\n“Nonsense! Surely the Eldrazi would make for excellent patrons!”\n\n“Two are either dead or immaterial, and Emrakul is still on Innistrad’s moon.”\n\n“Seriously? They *still* haven’t tied that plot point up?”\n“No.” \n\nLetting out a sigh of disappointment like a kid who didn’t get a PS5 for Christmas despite their parents making very clear that their financial situation couldn’t allow it, Faust slumps back into his chair, which creaks for its life as the lich crashes into it. Or was it perhaps creaking for death?","timestamp":"2023-10-19T00:36:59.290000+00:00","edited_timestamp":"2023-10-19T00:48:59.960000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"losthaven"},{"id":"1164361560823705610","channel_id":"1164361450102456401","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"“This was a terrible idea, sir. Just like the frying pan-”\n\nBefore Emily could even finish her critique of the lich’s clear lack of brain cells, Faust had already jumped out of his chair and in one swift motion, *kabedons* the unsuspecting maiden with malicious intent.\n\n“**Do. Not. Insult. The. Fr-**”\n\nFaust wasn’t given much time to finish his, either, as Emily reacts instinctually out of self defence.\n\n“AAIOGOUIIOIUUOUAOIIOUOIASGUHOOIOUIO-”\n\nFaust stutters some unintelligible nonsense as four bolts of eldritch energy blasts him square in the chest, sending the lich flying several feet backward and crashing into a shelf. The items topple and fall, several vials of unknown liquids breaking atop Faust’s head. And whatever the fluids were, the hissing noises they made when coming in contact with his skull could not have been good.\n\n“***Don’t touch me with your disgusting hands,***” Emily hisses venomously in Faust’s direction, eyes leering at the filthy creature as if she were gazing at the most sad, pathetic excuse for a parasite one could ever bear witness to.\n\n“*Jesus Christ,* some people are *into* that, Emily,” Faust retorts as he brushes himself clean. At his comment, all hope in the multiverse leaves Emily’s eyes as she prepares to rail him again with eldritch blast.\n\n“***Do you want to die, you impotent fu-***”","timestamp":"2023-10-19T00:37:08.892000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"losthaven"},{"id":"1164361584588636220","channel_id":"1164361450102456401","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"And yet once again, as if the multiverse itself wished to prevent a decent, young maiden from sullying her reputation by uttering aloud a dirty, filthy curse word, Faust’s… *cell phone?* starts ringing, blasting his obnoxious ringtone across the entire store. Without missing a beat, the lich answers. “Hello? Raven’s Arcana? Huh? What? Oh. Sure. Yeah fuck it why not?” A series of random, generic filler statements later, Faust hangs up, and without much of a warning, performs a triple fucking backflip with more excitement Emily had seen in the old fart since the release of Baldur’s Gate 3, before making a fucking ***dive*** into the floor and nailing a perfect landing. “AYO, DEMON INVASION AT ALBION, WE’RE FUCKING GOING!” Excited screams of joy come from the lich as he prepares for a new ‘adventure’.\n\n“Did the Guild request assistance?”\n\n“What? Fuck no! We’re watching the shitshow! Tell Alexiel to stop fucking her pillow and get the fuck off nhentai, get Kodbromaal to pack up the sign outside, and inform Xylzrilyn to go get some popcorn! WE’RE GETTING FRONT ROW SEATS, BABY! I’LL BE STARTING THE TESSERACT, WE DEPART IN FIVE!”\n\n“Tesseract? Did you plagiarise Castlevania?”\n\n“Plagiarise? I fucking improved Dracula’s dogshit design-” was the last thing Emily could make out as Faust disappeared to the control room.\n\n“I don’t get paid enough for this…” Sighs the young woman.","timestamp":"2023-10-19T00:37:14.558000+00:00","edited_timestamp":"2023-10-19T06:32:05.262000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":4,"userName":"losthaven"},{"id":"1166171321579876402","channel_id":"1163197898532606094","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Cult of  Iz'uthres","timestamp":"2023-10-24T00:28:29.480000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1166171321579876402","guild_id":"796570401681309696"},"flags":32,"thread":{"id":"1166171321579876402","type":11,"last_message_id":"1166171620319174827","flags":0,"guild_id":"796570401681309696","name":"Cult of  Iz'uthres","parent_id":"1163197898532606094","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"212762756271570945","thread_metadata":{"archived":true,"archive_timestamp":"2023-11-23T00:33:04.569000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2023-10-24T00:28:29.480000+00:00"},"message_count":4,"member_count":3,"total_message_sent":4,"member_ids_preview":["214058147499868160","212762756271570945","340862894998683658"]},"components":[],"position":0,"userName":"hanarei"},{"id":"1166171323748323459","channel_id":"1166171321579876402","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The flickering candlelight was all that provided light in the darkened halls. Stonework itself of the halls of the once great church worn with age. The once elegant stained glass was boarded up as if to prevent light from pouring in, although rather than the open air instead dirty threatened to pour in, in some places having even shattered through the glass leaking into the room. \n\nIt was a place as if lost to time having been built centuries ago and long since sank within the very dirt.  An almost reflection to the very woman leading the group now residing within such a once hallowed domain. The once belltower being the only part sticking out above the ground overgrown by plant life with the steps once leading up to the bed now a decent down into the church itself having become in a way a dungeon.","timestamp":"2023-10-24T00:28:29.997000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"hanarei"},{"id":"1166171345927811243","channel_id":"1166171321579876402","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Upon where once an alter sat, instead a wooden throne was positioned. A woman with long dark hair tinged with a light almost surreal of purple teasing through the black. A strand of white fell into place as black horn like parturitions stuck from the sides with 1 large diamond like spine jutting at the center of her head with two smaller ones slightly off angle from the center. Gentle blue eyes glanced out almost seeming soft compared to the rest though making her gaze look that much more haunting. Being of a modest height her striking white skin appeared both flawless but in a strange way almost haunting in shade. \n\nHer curvy figure showed off rather prominently with her outfit. The tightly wolven fishnet material clung to her body from the collar around her neck acting as a form fitting through teasing window to her body etched with more condensed stitching to create the shape of flowers to embellish the top. Her shoulders were left bare electing to wear dethatched sleaves. The purple dress itself reached up to cover her chest though not being afraid to show off her figure as the fish net was tucked underneath as if showing some feint sign of modestly. \n\nHer long legs teased off as the dress itself tapered off stopping in just a way as if to expose herself further though covering up as if the dress swept over in just the right way to cover down her other side before wrapping around to cover her side. Purple cloth covered down her backside acting almost as a cloak with a lighter shade of a purple on the interior. A pair of elegant heals rested upon her feet that when standing would give the woman a few more inches of height making her appear taller.","timestamp":"2023-10-24T00:28:35.285000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"hanarei"},{"id":"1166171486210494474","channel_id":"1166171321579876402","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**\"My lady... it happened as it was forseen. The portals of hellfire opened across the sky of Albian and enveloped the land in chaos. It seems as if it had indeed centered around Williamstown though it had spread across the kingdom. The threat itself has seemingly been taken care of as was last reported.\"**\n\nZaria's eyes glanced out looking almost blankly. The woman blinking as she let out a soft sigh standing up as she towered up over  the cloaked cultist kneeling before her. The woman giving a light nod as if to acknolwedge his words as the cloaked man slowly stood up. A few others lingering around the room all seemed to glance up their faces all obscured by the shadow of their hoods.\n\n**\"I will head over then to see if there are those in need of my help. Send some other members to provide service from the followers of Adix. It is only right we should provide them aid... and in response garnish more supporters. The guild has yet again failed in being effective protectors... a shame... but it is within our power to help. A shame... Hastur could be doing so much good for the mortals... yet he sits idlely by refusing to allow them to reach their full potential. All because that one foolish man so content to his ways he would allow a treasured ally to fall into darkness rather then embrace our destiny...\"**\n\nZaria spoke with a certain degree of meloncholy as she looked out not out of anger but seeming disapointmnet. No, as much as she felt betrayed, she wasn't about revenge. That was never the way she had once been nor even today. She simply gained a new step of being where she could enact the proper measures to work to fix the mistakes made and to make the world a better place. She had once been a source of salvation for mankind... that hasn't changed... the only change was the type of salvation she sought to bring.","timestamp":"2023-10-24T00:29:08.731000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"hanarei"},{"id":"1166171620319174827","channel_id":"1166171321579876402","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**\"May we bring salvation to the world and it's people, so they might find their true destiny and a fate of which will lead them beyond with the stars.\"** She spoke lifting her hand up as the cultists bowed their head their words coming off as a chant.\n\n**\"May her blessing bring forth mankind's salvation, and our future.\" **\n\nZaria's heals clicked across the stone floor making her way up to the front of what was once the front door. It had been since busted through as dirt had piled inside now a hardened mess. before it, a circle was etched on the ground containing eldritch symbols. Purple candles flickered as she approached the color shifting from a red to a eerie black. \n\nTwo of the cultists entered with her standing robed as they cusped their hands together. Their voices speaking yet the words coming off surreal as if speaking tongues. The black flames flickered as Zaria's eyes shut fixating on the location she wanted. A hideout for the cult located within Albion, one of just many they had established over time. \n\n Zarian's hand lifted up as her finger traced along the air as a strange black like ink seemed to become etched within the very air itself. The markings flickered and wiggled about almost as if alive. The marking being of the location she wanted. The symbol glowed a eerie purple before Zaria and the cultist's bodies distorted as if their very bodies were turned to liquid before splattering apart falling to the ground and dissipating as if soaking into the ground. The candles flickered once more turning back to a red flame.","timestamp":"2023-10-24T00:29:40.705000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"👍"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":"1010424876030500944","name":"Cr_shamura"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"hanarei"},{"id":"1167917480249929819","channel_id":"1163197898532606094","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The City Of Lithos, Visuden","timestamp":"2023-10-28T20:07:06.149000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1167917480249929819","guild_id":"796570401681309696"},"flags":32,"thread":{"id":"1167917480249929819","type":11,"last_message_id":"1253082521206521869","flags":0,"guild_id":"796570401681309696","name":"The City Of Lithos, Visuden","parent_id":"1163197898532606094","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"214058147499868160","thread_metadata":{"archived":true,"archive_timestamp":"2024-07-19T20:31:34.697000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2023-10-28T20:07:06.149000+00:00"},"message_count":59,"member_count":5,"total_message_sent":61,"member_ids_preview":["214058147499868160","198327629047267328","108757318849531904","993397722285613087","340862894998683658"]},"components":[],"position":0,"userName":"kyroscript"},{"id":"1167917481856348340","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"As time passed the steel contraption shuffled the remnants of the Eldorian nobles, which had escaped their country’s rule, closer and closer to their city of freedom, Lithos. \n\nAmong them was Simra, whom the survivors had vouched for as a trustworthy member.\n\nBeyond them in the dawn rose airships and buildings that threaten to cut the very sky in half. Steam and smoke rose into the air while the upper class watched from their flouting glass contraptions.\n\nBelow the airborne inventions motor vehicles drove the streets of those privileged enough to afford them. Metal poles marked area where light would produce itself should the sun ever fail its denizens and from across the buildings metal rooms would take its citizens to the far reaches of the buildings and back. Stone fountains sprayed water for decoration and comfort, all the while the general populous enjoyed the hot rainless days which would only last them so long. \n\nMost of the city was powered by refined Orcobras, and Simra watched in silence as somewhere beyond the crystal powered walls was an object which would contain the most important of her lost memories.  The truth behind the Eldorian Kings death one hundred years ago. \n\nPiercing screeches crossed her as the train came to a halt. This station was emptied out for the nobles arrival and as they passed into the empty space the trains operators offered assistance once more. \n\nThey were stressed and careless, only aiding those who expressed pain. So many of the nobles simply walked away and to their designated locations. It seemed Phoe Selhorn still intended to have them as an audience for her reveal tomorrow, and so the nobles went to their room and retired.\n\nSimra wouldn’t need them for this next part, so she let them go and she herself headed to the edge of the city. At the entrance of the tunnels below the Visuden military prepare for their engagement of the enemies within the labyrinth.\n\nSimra would not be able to enter that way, so she passed into an abandoned building and made her way down a premade makeshift tunnel. As she reached the bottom she was met by a woman with silver hair.\n\n“Your late…Although, I suppose time is not exactly an expectation I should be holding you to. Please follow me.” She said giving a masked smile to Simra.\n\nSimra nodded and followed the women into the deep recesses of the underground tunnels beneath Lithos. After a time, they reached man shuffling a deck of cards.\n\nAfter he saw her, he cut the deck once more and laid it down on the table.\n\n“I see your partner isn’t here….Lets get started without her then, I have waited long enough.”","timestamp":"2023-10-28T20:07:06.532000+00:00","edited_timestamp":"2023-10-28T20:11:57.892000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"537931294017847327","name":"ULTRAPOGGERS","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kyroscript"},{"id":"1169445532452790313","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From the corners of the city a distance metal sheen descended from the sheets of cloud which covered spots of the view above. Within the airship Circley and the others would see the full of Lithos, and the pride of Visuden. \n\nThousands of lives of all different races and cultures walked along to beautiful cut stone. From point-to-point smaller airships took members of the city to other parts of the metropolis, while trains took up a similar job and to distance heights elevators of emasculate glass would carry the population. \n\nAll while its complex architecture covered the ground nearly as far as the eye could see, a living breathing city, and a miracle of combined creation. Every time Circley saw her home it make her feel at peace.\n\nHad she not been restrained by her sister every time her entered, or cursed by her adoptive mother she would certainly spend more time in Lithos.\n\nAs the ship passed over the back half the city smoke rose up into the windows. The industrial section of the city. Factories housed the less fortune of the citizens and reminded many of the sacrifices that keep this place alive.\n\nPast even the industrial section of the city lay the flood walls, massive structures build around the entire city to funnel water deep beneath the ground from the outside. Each of the four entrances lead below the ground and none are exits, somewhere deep beneath the ground the water is taken to another location.","timestamp":"2023-11-02T01:19:02.184000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[{"id":"1169445532222095451","filename":"Lithos.jpg","size":1521141,"url":"https://cdn.discordapp.com/attachments/1167917480249929819/1169445532222095451/Lithos.jpg?ex=66a8e846&is=66a796c6&hm=f79148148cc4c85766633a2b5b00c1ebfb28947f5b279e41dc1710e7c02e8bbd&","proxy_url":"https://media.discordapp.net/attachments/1167917480249929819/1169445532222095451/Lithos.jpg?ex=66a8e846&is=66a796c6&hm=f79148148cc4c85766633a2b5b00c1ebfb28947f5b279e41dc1710e7c02e8bbd&","width":1888,"height":2560,"content_type":"image/jpeg","content_scan_version":1,"placeholder":"F/gFDQANeWmnOWVod3RJd3xQ2wvk","placeholder_version":1}],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🚂"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🏭"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🌊"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"kyroscript"},{"id":"1169446359024287806","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Waves of air expanded out from airship as it ran several circles before attempting to land. Behemoth watched from below as the air pressure washed over him. After having been carelessly defeated on the train, Phoe had ordered him to make for the flood tunnels, an idea he admittedly detested, but was unable to refuse. \n\nSince then, Behemoth was stationed on the outside of the entrance, attempting to block any exits or entrance of unwanted members. The lack of anything interesting had built an itch to tear apart enemies. Circley’s presence was a welcome relief if it meant he could finally enter. \n\nAnd from the Airship she descended with the other adventures.\n\n“Ilya, Cater, and Biance, this is Behemoth. He will assist you in your endeavor. “ She said.\n\nBehemoth gave a bow of respect and began to explain the plan.\n\n“Pleasure to meet all of you. Although pleasantries are not my particular strength. Let’s get some ideas clear, we are the front line. After we clear areas Visuden’s men will follow behind us. There are armies at all four entrances which will begin clearing with small groups. \n\nDue to the likeliness of traps, no large group of Visuden soldiers will ever enter at once, but we will have support on other sides. So, we don’t need to clear everything.”\n\nBehemoth paused, giving everyone time to digest his explanation.\n“I won’t give any of you orders, but stick to your strengths, and when your ready, meet me at the entrance to the tunnel.”","timestamp":"2023-11-02T01:22:19.254000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[{"id":"1169446359183675488","filename":"Tunnels.jpg","size":67901,"url":"https://cdn.discordapp.com/attachments/1167917480249929819/1169446359183675488/Tunnels.jpg?ex=66a8e90b&is=66a7978b&hm=de84578353cee69e64030fd555c4540440a7828e19cadc6952b1fd80ac6923d4&","proxy_url":"https://media.discordapp.net/attachments/1167917480249929819/1169446359183675488/Tunnels.jpg?ex=66a8e90b&is=66a7978b&hm=de84578353cee69e64030fd555c4540440a7828e19cadc6952b1fd80ac6923d4&","width":564,"height":831,"content_type":"image/jpeg","content_scan_version":1,"placeholder":"GPgJFQJ1h3x4OKi4h3H3eHeAeQiX","placeholder_version":1}],"embeds":[],"reactions":[{"emoji":{"id":"537931294017847327","name":"ULTRAPOGGERS","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🪖"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"kyroscript"},{"id":"1169447122567970927","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"@_coiiapse @reinhardt (Pulling you into this thread)","timestamp":"2023-11-02T01:25:21.297000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"108757318849531904","username":"reinhardt","avatar":"813677b2ff03227a8e1268244a07f228","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Reinhardt","avatar_decoration_data":null,"banner_color":null,"clan":null},{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null}],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"kyroscript"},{"id":"1169449207329996811","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Including the adventures, twenty-two bodies stood at the entrance to the chasms of depths of Lithos. There was a soft whistle of air from within as the outside wind passed through the spiraled entrance and echoed off the walls. \n\nAs each person formed in front of Behemoth, he did a small headcount following a loud signal for each member to make their way in. For a while the group passed slowly step by step, those that were more proficient at scouting took the lead several lengths ahead. \n\nAs they walked the entrance slowly fell closer and closer out of sight, the light it provided dimming more and more. Behemoth pulled out his hand and formed fire at his fingertips to light around him, while other members lit lanterns. Beside them multiple pathways of tunnels were filled with darkness. Much of the member briefly looked to the left or right as they passed, but the darkness was far to great to see anything down those tunnels, and they need only stick to the main tunnel regardless.\n\nHe looked down as the dirt stuck to his shoes. At the bottom of the massive tubes lay consistent water which had gathered muck for some time, and in turn slowed the group’s moment, most of which lay behind him positionally. \nHe looked up to call for the scouts to return and give a report, but during the middle of his shout he was cut off. The waking silence that had built up over time from the groups consent of peace was crumbled by the cord of a vibration of destruction.\n\nFrom behind a massive explosion of devastation cut through the concrete foundation that would hold the entrance intact. While one was seen, three other ear shattering shockwaves followed from a distance, and the rocks of the entrance collapsed behind the heroes cutting off the closes means of assistance or escape.\n\nBehemoth made swift action to call out for those in front.\n\nBut before he could get a single word a bullet tore through his chest and rendered him ineffective, becoming submerged in the pool of muddy water below.\n\nFrom the side of the tunnel men covered head to toe in winter clothing steps out from the shadows and began firing on the group from all side. Some of the casters attempted to form a magic shield as protected, threads of mana spun in circles, weaving together a web of protection. But before they could finish collections of metal cut through their bodies and the dome of protection shattered.\n\nFrom a distance flashes of light could be seen, shots from the location of the scouts, which had been ambushed as well.\n\nThe hope of survival dwindled by the minute.","timestamp":"2023-11-02T01:33:38.343000+00:00","edited_timestamp":"2023-11-02T01:41:20.496000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"600972229911642112","name":"sadcat"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"806009611970281502","name":"cursed_gun","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"378750127747104778","name":"blobsweats"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":4,"userName":"kyroscript"},{"id":"1169485199168516138","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"When the first shots rang out, Ilya immediately tightened her grip on her compendium and started casting the fastest and easiest form of shield she knew, *ironskin reinforcement*. Her left hand glowed with magic power as she tapped herself, applying a layer of physical defense on herself. From the middle of the team, she started reaching out to others in her immediate vicinity, starting with Carter and Bianca, applying the same shield onto their persons. With a defense on those within her reach, she lifted her hand into the air and let mana flow from her fingertips, reinforcing and taking over the faltering magic barriers that the other casters couldn't complete.","timestamp":"2023-11-02T03:56:39.466000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🛡️"},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":5,"userName":"alteras"},{"id":"1170106679153668278","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Multiple shots began firing from all directions, but Carter's eyes never strayed from the first shot that started it all. She quickly unholstered her weapons in sharp movements, very nearly dislodging Ilyas hand and efforts to keep her in one piece, and snapped her own bullet right back, letting it lance through the falling bodies to find its mark using the same trajectory as their unknown assailant had used. \n\nA smug and feral grin stretched on her lips when her shot landed, as silver fire burst from the silver casing to devour flesh and bones. A perfect performance, even if they were forced to start on the back foot, and it gave her just enough moxie to address and try to regroup the remaining troops. \n\n**\"Steady on your feet, soldiers! There's your Captain leaving for the next life - and we're sending every little rat here on the other side with him back to the Maker in pieces!\"** She raised both canons up with her declaration, letting silver continue to grow brighter and brighter at the mouth of her canons. She grit her teeth as two shots hammered into her reinforced torso and arm just before Ilya finished weaving in repairs to the spell dome, but that didn't stop her from releasing 4 sizeable silver shots into the air, letting it hang and diffuse - aiming to temporarily blind the gunners around them.","timestamp":"2023-11-03T21:06:11.841000+00:00","edited_timestamp":"2023-11-03T23:42:27.833000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"860251227627585536","name":"KoroGun"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":null,"name":"🇲"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🇴"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🇽"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🇮"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🇪"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":6,"userName":"_coiiapse"},{"id":"1170288237076553779","channel_id":"1167917480249929819","author":{"id":"108757318849531904","username":"reinhardt","avatar":"813677b2ff03227a8e1268244a07f228","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Reinhardt","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"There it was. The unmistakable stench of despair. The all-too-obvious ambush that had caught the troops off-guard, the sudden burst of shrapnel and shots that proved to be more than enough to crumble the group's force. With their captain downed, their mages failing, and the constant fire of their enemies, it was clear that those that were lucky enough to remain saw the futility of action in the situation.\n\nBut such was not the case. Not for the two distinguished guild members, and certainly not Bianca.\n\nAs Ilya sought to reestablish a defense line and Carter retaliated, Bianca stepped forward - wielding the blunt side of her sword like a shield, effortlessly blocking and deflecting shots that came to her path, almost as if every shot, every gunfire flash proved to be detrimental to the wielder's aim. She grabbed the wounded, dragging them back to Ilya's vicinity as she re-established magical defenses.","timestamp":"2023-11-04T09:07:38.623000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":7,"userName":"reinhardt"},{"id":"1170288244265598996","channel_id":"1167917480249929819","author":{"id":"108757318849531904","username":"reinhardt","avatar":"813677b2ff03227a8e1268244a07f228","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Reinhardt","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Then, she turned, her gaze not lowering, her stance unfaltering. Sword raised to the sky.\n\n\"Rise, children of Visuden. Let not fear consume you. Let not these bullets control you.\", she said, with a powerful voice that seemed to resonate around the room. The shots being fired towards her direction bouncing off thanks to the cumulative defensive enhancements by Ilya's magic, her enchanted equipment, and her unique nature - like an invincible hero that stood in the face of danger.\n\n\"Raise your blades! Scream your chants! Aim your weapons!\", she commanded. \"This is not the day you shall return in pieces! Let evil face its judgement - for the light of victory shall shine on the righteous!\"Her blade, for a moment, shone briefly like the rising sun. Her brows furrowed, gaze darting from one gunfire flash to another - almost as if pinpointing their location.\n\nShe's seen this before countless times. She's been here before countless times. Ambushes in a dark place - maze-like ruins, unlit caves, nighttime battlefields.\n\nHer sword was lowered, pointed forward. Both hands on the hilt, and a classic stance for advancing forward.\n\nThe Warsaint has emerged.","timestamp":"2023-11-04T09:07:40.337000+00:00","edited_timestamp":"2023-11-04T09:08:10.340000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"971249518026838108","name":"MarinaSalute"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":8,"userName":"reinhardt"},{"id":"1170935310910234684","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From below the makeshift stairway a women descended. Inside her destination rested Simra, the silver haired women, and another man. \n\n“Ah you have arrived.” He said looking to her.  “We just finished the logistics; Simra will fill you in on those as we move forward. However, there was something I wish to discuss that requires all to be present. I would like to change our terms.”\n\nShe gave the man a look of question. “This is unexpected. I believe we were quite favorable to your goals when we decided the terms. Even going as far to agree that you will rule Visuden, what more could you desire?”\n\nThe man smiled. “Indeed! That is what I refer to. I don’t want to rule Visuden anymore.\" Leaning forward, he repositioned himself.\n\n\"I saw a vision of a Melicau where all kinds came together. No wars, obstructions and where the whole species ruled in harmony. I’ve had a change of heart, no one man should rule all things, but stand on equal ground to those that would share the same dream. For the time being all of us share a goal.”\n\nThe man looked to the women beside Simra, her partner. “I want you to rule Visuden instead.”\n\n-----","timestamp":"2023-11-06T03:58:53.047000+00:00","edited_timestamp":"2023-11-06T05:08:55.029000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":9,"userName":"kyroscript"},{"id":"1170935349971783731","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Filuent looked up to see the threads of the barrier she had attempted to create shatter as an iron bullet tore through the head of her close friend. The break in mana threw her to the blackened water below. As she choked on her fear, the dark liquids reached into her lungs, while she saw more allies fall beside her. The shadows of her doubt closed in, and soon her eyes failed her. \n\nThe vacuum of her mind was all she could see anymore, and within it she saw a white paper slowly stained with ink. From the outer edges it crawled to the middle reaching across the naive ideas she held. The night covered the surface to reach dripping saturation and starve her any remaining hope.\n\n “Rise, children of Visuden. Let not fear consume you. Let not these bullets control you.”\n\nFrom the center, purity of light sought to evaporate the watered shadows and cure the stains of black from her mind. Such light reached to the edges of each member, lifting their spirits from what held them before. \n\nCarters shots blinded the shooters and gave Filuent moments to stand up. She touched the hand of Ilya who was attempting to finish rebuilding the barrier. With the relief of the opposition’s pressure, others followed and joined in the circle. Spiraling mana connected around the group in hexagons that filled to completion, holding against the enemy’s rounds for all allied forces.\n\nShouts of support rained behind Carters words, and marksmens of Visuden rushed to her side, firing in tandem to support her movements, while long spell casters had time to form devastating area hits.\n\nIn a short time, the enemy was forced to take cover in the smaller receding tunnels. One of the marksmen motioned to step out of the barrier but Filuent called for him to stay. For the mages around Ilya could see there was something amiss.\n\nFar forward where their destination laid, within the convergence of tunnels there was a clogging of mana, unnatural in proportion. Waves of excess energy poisoned the air and lines of dense magic floated following paths of least resistance.\n\nFrom the central direction ice shockwaves swept across the battlefield turning the land into a blizzard of unstoppable proportions. The only water unfrozen lay within the barrier they had created, along with the remaining heat that the ice had yet to consume on mass. Fueled by unknown energies, snow spiraled the tunnel with no signs of slowing down, prolonged exposure would exhaust the heat from the unprepared and lower their speed.\n\nBreaking through the waves of white, descended more men of the opposition originating from scout’s location. Filuent whispered a silent prayer for those she knew, but within her soul despair would not yet find her again.\n\nHeavily clothed men in shields formed a wall and from behind that wall peaked more weapons of range. Large, over the shoulder, mental tubes contained refined Orcobras within. The spinning crystals released balls of fire toward the barrier. Flames crashed against the dome reaching over the veins of magic. The sphere cracked briefly before healing, but more shots of fire sought to shatter the mages work. \n\nWithin the center of the fortification a nonmortal being made of wood and cloth stood commanding them, waiting for the claws of the bitter cold to swarm the interior should the hero’s strength fail them.","timestamp":"2023-11-06T03:59:02.360000+00:00","edited_timestamp":"2023-11-06T04:45:58.167000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[{"id":"1170935349753683998","filename":"Wooden_man.jpg","size":76785,"url":"https://cdn.discordapp.com/attachments/1167917480249929819/1170935349753683998/Wooden_man.jpg?ex=66a90dc6&is=66a7bc46&hm=3769f9c5c1b897cbe9df2d13eac389b847efb0ce70d574ee7952f42965988202&","proxy_url":"https://media.discordapp.net/attachments/1167917480249929819/1170935349753683998/Wooden_man.jpg?ex=66a90dc6&is=66a7bc46&hm=3769f9c5c1b897cbe9df2d13eac389b847efb0ce70d574ee7952f42965988202&","width":564,"height":797,"content_type":"image/jpeg","content_scan_version":1,"placeholder":"WtcJFQL7hWmDVXZ4iXaWZ7lwiAqH","placeholder_version":1}],"embeds":[],"reactions":[{"emoji":{"id":"616963783419756554","name":"IfritFlame","animated":true},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":"1093298644062576750","name":"whyucrying"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":10,"userName":"kyroscript"},{"id":"1170980814612336660","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"As a wall of shields appeared before the group alongside the blizzard, Ilya squinted her eyes. The arrival of more enemies was troubling but the hastily reinforced magic barrier was holding on. Rather, just like the others sensitive to the arcane, Ilya was more concerned about what lied further within the labyrinth.\n\nIlya pushed more mana into her vision, dying her eyes in a deep mystic blue. With her arm still holding up the barrier, she gazed in the direction of the enemy lines, past the figure cloaked in winter, and into the abyss. Her sight flew down the tunnels, past the poor bodies of the fallen, and through the languid and sick air of magic before stopping at a central room. There she found the source of the ill feeling.\n\n“Shit…” Ilya let loose a quiet mutter, masked only by the crashing sounds of missiles against their barrier. She shook her head before turning her attention back to the battle before her. With both Carter and Bianca raising morale and fighting back, and the barrier blocking the enemy attacks, their group was being held together. The surrounding enemies from the initial attack were being dealt with. But both the hostile wall before them and the trouble beyond has to be dealt with.\n\nIlya released her grip from her compendium and placed both arms forward, pointing to the ground between them and the enemy. Her compendium flew from its harness and flipped across several pages midair. Both it and its owner started glowing a shimmer of gold, and soon sparks stretched across the ground.\n\nMumbling out a chant under her breath, Ilya slowly raised her arms, lifting the golden line into the air. With each verse and twitch of her arms, the line raised higher and higher, leaving behind a wall of intricate and interlocking circles of magic and mana. Like the gears of an impenetrable safe, the sigils spun and jumped around, sparking ember lights. Soon the wall was raised high enough that shells from the enemy crashed into it, only to bounce away as if it wasn’t there. The now calmed mages rushed to supply their own mana towards the new magical structure, releasing the far weaker one into nothingness.\n\nThe line of magic eventually reached the top of the tunnel, sealing enemy, their weapons, and their storm to the other side. Ilya sent a knowing glance to both Carter and Bianca that seemed to imply there was only direction they could take. Ilya then shifted herself into a pose reminiscent of shield bearers of old. The regrouped mages took their own stances to reinforce the golden fortress.\n\n“Forward march!”\n\nAnd all in concert, stepped forward, pushing the shining barrier one step against the snowy abyss.","timestamp":"2023-11-06T06:59:41.975000+00:00","edited_timestamp":"2023-11-06T07:06:02.335000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"737468966364250173","name":"WorryHonk","animated":true},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":11,"userName":"alteras"},{"id":"1173820258923065405","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter breathed a little easier as the immediate bite of the blizzard was held back by the mages' efforts and golden shield. The time to move was now, before the enemy drew them into their next act, this was a golden opportunity to pivot and take the lead.\n\nThe path forward was not hers to take, all but claimed by their Warsaint, but the canon fire raining on their shield struck a chord in her - in her pride, perhaps. This felt like a challenge, and Carter refused to be outdone by such a boring and traditional performance by the other side. \n\nAside from the great satisfaction that would come from ruining the enemy's offence, Carter knew that stopping the fireballs from the other side would give their mages and marksmen more time, more options to return the offense in full.\n\nLooking around her, she spotted 2 marksmen with just the right equipment for her planned sabotage. **\"I'm afraid those won't make it past the storm they've brewed - or worse, their front lines catch it and throw it right back at us,\"** Carter pointed one of her guns down a tunnel coming up, **\"what say you we run their own paths and knock on their front door?\"**\n\n**\"They must have reinforcements crawling all over those tunnels,\"** the marksmen pointed out, seemingly in protest, but his eyes were hard, and firmly securing his grenades. \n\n**\"And I have an idea for that,\"** Carter replied, with a tip of her hat, **\"we need to close as many tunnels as we can, close them off, cave them in, bury and burn the ones behind us so they can't wrap around our rear ... force them to meet us only where we want to fight them,\"** and unspoken was the idea of keeping casualties to a minimum\n\nWord began to spread quickly. They stood ready to lob smokes and grenades at the numerous tunnels; the first to go in would be explosives, and then they would make the tunnels cave in ... the enemy could only choose to burn in place, or seek out other paths ... paths that crossed their readied soldiers.","timestamp":"2023-11-14T03:02:38.253000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":12,"userName":"_coiiapse"},{"id":"1173820260424634450","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"And hopefully the enemy would be none the wiser if only three of their pitiful number were suddenly not present. \n\n**\"Grey, find the coldest path for me, we're going right into the eye of the storm,\"** Carter instructed her winged companion, as the first of their volley of explosions flew into the maw of the tunnels. She let him fly in first before following after, leading the two marksmen with heavy grade shells into the enemy's tunnels. She immediately let two silver fireballs raze the left path, making sure nothing with a beating heart would follow behind them as they darted down the right path, hurrying towards what would hopefully be the enemy's canons.","timestamp":"2023-11-14T03:02:38.611000+00:00","edited_timestamp":"2023-11-14T03:04:30.515000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"616963783419756554","name":"IfritFlame","animated":true},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":"1095894385813635142","name":"silenceOwl"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"1155556183252402196","name":"kirby_has_a_gun"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":null,"name":"💣"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":13,"userName":"_coiiapse"},{"id":"1176349134102474812","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From behind the walls of metal and fire, the sentinel of wooden stood within his Eldorian men. Torrents of snow spun in clouds around him, while the tunnels began filling slowly from the extended storm. \nWithout any form of explanation, the Eldorians began to alter their moments, like machines who could communicate without language, shifting their tactics. No good would come of continuing to fire upon the barrier, so they set their aim to the smaller tunnels to prevent Carter and others from passing forward, firing their explosives down the smaller entrances instead.\n\nTheir wall of shield began to falter as Ilya’s barrier pushed forward, those that stepped too close to the mana threads would quickly find themselves swept underneath and killed by the Visuden frontline.\n\nEldor began backing up, their movements mirrored the speed of Visuden but pressure from the sides ultimately resulted in a net loss for Eldor.\n\nAs both sides moved closer and closer to the center of the sewage structure the scenery around them altered. The tunnels became less and less made of concrete, and instead replaced by veins of raw Orcobras running deep into the ground below. The pieces of crystal ore wrapped around the main pathway becoming the majority of its surface, while the smaller tunnels became entirely made up of the mass of shining ore underneath the city. \n\nThe storm of ice faded flake by flake as it was clear that whatever rested at their destination had halted the production of more icy fury. Perhaps due to its ineffectiveness toward their enemy.","timestamp":"2023-11-21T02:31:29.080000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":14,"userName":"kyroscript"},{"id":"1176349142713372672","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"As their movement continued, they began seeing what the Eldorians had been constructing underneath Lithos with their time. From beneath their feet reached multitudes of metal poles directed into the ceiling above. It was clear the surrounding area had been cut to allow for the metal to pass deep into what lies above and below them. Whatever their iron origin or destination lie, the men and women of the Visuden military would be unable to see it currently. Where they stood was the intermediate place between such starting and ending point for these metal currents. \n\nBoth the Eldor forces and Visuden would shift their steps to account for the forest of iron trees.\n\nAt some point the Eldor forces came to a flashing halt, at which time they had lost nearly half their men to either the smaller tunnels where Carter picked them off or the moving barriers firepower. \n\nThe tide slowly shifted toward our hero’s front. But the relief that the Visuden men had gathered would be short lived. The Eldorians began unpacking supplies of metal casing which they attached as backpacks. From within green crystals released air along tubes into their lungs. They too then cast a barrier over themselves which covered all sides, and then laid waiting in silence.\n\nAnd from the not so distance caverns, a similar feeling of mana filled the air again. Filuent and many others called out this time to warn that another wave of ice was approaching. But their cries would come in vain as it was not ice which they would encounter.\nEncroaching with aggressive speeds, a tsunami of water would flood the central tunnel. The fierce flurry of blue washed over the Eldorians and crashed against Ilyas barrier slowly filling up the side which the Eldorian inhabited. As time passed the water rose higher and higher seeking to eventually reach the pinnacle of the tunnel’s capacity. \n\nWithin the smaller access holes where Carter was the water would beginning pouring through every location sweeping away anyone within them and Visuden would be forced to realize their situation. There were far too many tunnels to plug them all up, and with the Eldorians no doubt preventing the water from draining at the central source, it would slowly fill up their side disrupting their cast on the barrier, or eventually robbing them of their air. Eldor released their barrier and began swimming into the smaller tunnels to reach around Ilyas barrier, their crystals providing a near infinite supply of breath. This time, unless their enemies could solve the problem of air, they would have little resistance reaching the backside of the barrier.","timestamp":"2023-11-21T02:31:31.133000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":15,"userName":"kyroscript"},{"id":"1177412590322843679","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"They had made good progress, Ilya was sure of it. Although quite brute force, the simplicity of a marching wall of mages in such a confined space equated to undeniable strength. As for the mages themselves, Ilya felt they had regained enough composure to start supporting their other mates. And while maintaining such a barrier was usually done by external catalysts, the mutual understanding of such a simple conceptual barrier by skilled mages made cooperation easy. If they continued as such, Ilya was certain they'd be able to push the enemy all the way to their loss, but battles with magic never stays the same.\n\nIlya's eyes narrowed as various changes started occurring on the other side of the barrier. The early warning made the mages strengthen their hold on the barrier, but the sudden arrival of water forced them to halt their progress entirely. Watching the other side turn into a sudden aquarium of enemies made Ilya grit her teeth. The pure amount of mana and insanity needed to create a situation where the tunnels, specifically designed to handle immense amount of flood water, would not only fill with water in the middle of a dry season was ludicrous. *And they even brought diving gear!*\n\nRegardless, with their own side filling with water, she couldn't just wait for the enemy to break first any more. Taking two steps back and bringing her grimoire before her, Ilya started yelling out. **\"I'll take command and alter the concept of the barrier! Maintain the magic strength!\"**\n\nThe grimoire flipped a multitude of pages, each containing a wide variety of text, drawings, diagrams, from multiple different styles and handwriting. Eventually it stopped on a page filled with notes and diagrams in Ilya's own handwriting. Chanting out new words clearly not in a language local to the region, Ilya drew upon her master's teachings in spellweaving. The barrier itself shimmered and changed color into a silvery white. Magic circles and sigils within the wall spun and spun until they morphed into new sigils. Soon the arrangement of circles no longer resembled a vault wall, but rather an array of arcane armament, with circles glowing a chilling silver.\n\n**\"INCREASE MANA THROUGHPUT!!\"** And with a shout, the silver wall of magic circles started firing magic ice shards into the water. As the ice sailed through the dark waters, slamming into the enemy's own people, the liquids nearest to the wall started to freeze solid.","timestamp":"2023-11-24T00:57:16.801000+00:00","edited_timestamp":"2023-11-24T01:05:40.525000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🧊"},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"729113852981018728","name":"peepostab"},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🍨"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":16,"userName":"alteras"},{"id":"1178507027413217380","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter and her company had just a brief moment to account for the changes in their surroundings, noting the muted glow of the raw Orcobras veins ahead of them before the first wave of raw sickly sewage water came rushing forth. Panic arose, but was tempered easily by all three individually. It was damned good working with professionals. \n\n**\"2 bodies,\"** the female marksman, Octavia, supplied curtly, standing firm against the currents sweeping at her feet. \n\n**\"We need an out,\"** Carter returned, turning her head back to where they had already travelled past, knowing well that the Orcobras ore laid out before them wouldn't play with any of their plans. \n\nAs luck would have it though, the tunnel they stood in trembled, and was suddenly surrounded by a chill, then frost began to eat away at the walls, before being outright punctured solid ice, stopping the gentle rush of sewage water from further travelling down their way. For now. \n\nAll six hands began to work quickly. Octavia passed her shell over to Carter, hands pulling off pins and belts from it as she the standard looking rifle in her hands began sparking, chamber visibly preparing something electrifying; with the other marksman, Julian, follow suit.\n\nBoth Visuden marksmen fired three charged rounds far into the tunnel, where the ominous splash of water and waves continued to echo. As soon the charged rounds made contact with the disgusting mix of sewage water, minerals, and impurities, the tunnel lit up spectacularly - but Carter didn't have time to wonder who was getting deep fried down the tunnel, and immediately launched the charged shell in her hand over the impromptu ice barrier before ducking behind it. \n# BOOOOOM\n\n**\"Clear,\"** Julian called out, peeking over at the smoke and debris. **\"Right side's are blown open and leads back out to the main path - our sides pushing forward, casting ice - hell, it's already slipping in and eating away at the water down our road.\"**","timestamp":"2023-11-27T01:26:10.937000+00:00","edited_timestamp":"2023-11-27T01:26:17.468000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":17,"userName":"_coiiapse"},{"id":"1178507134820941835","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**\"Solid ground,\"** Carter smiled, **\"now we just need to make this last shell count, give our people a nice hell fire to watch,\"** with renewed energy, the three continued down the frosty tunnel, arms trembling from the chill but determined to deliver their package.","timestamp":"2023-11-27T01:26:36.545000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🧊"},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":18,"userName":"_coiiapse"},{"id":"1182188749380132985","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"A crystal blue tint of light reflected off the filament covering Filuent’s iris. With the combined efforts of her and thirteen other survivors, death swept across the Eldorian army. The combination of several well-placed moves from Visuden had caught many of the Eldorian souls who were vastly unprepared, and a shadow of annihilation had come to seek its dues. More effective than even Ilya had anticipated, the ice reached far across the surface of the waves restricting the movement of many of the divers. \n\nScythes of frost tore away at the unsuspecting grunts and dyed the liquids with blood. Outside the open waters the cold pressed into the tunnels and multiples of Eldorian men were trapped, then entombed within those icy crystal halls.\n\nContinual shockwaves of water hit the barrier of ice and mana, but as it reached a little over halfway something unexpected happened, the liquid stopped its ascent. Even with the Eldorians blocking the major exhaust for the sewage, the effectiveness of Visudens engineering had outperformed expectations. At their maximum output the Eldorians could only hope to achieve a little above sixty percent active capacity of the main tunnel.\n \nWith the walls of an arctic prison closing in, it was Carter, Octavia and Julian's shots that dealt the final blow. Three tracers of light charged with electric energy raced across the tunnels speeding over the open passageways frying the pests attempting to craw their way through the gaps. When the currents took to the open waters the shocks of lightning reverberated within the metal poles like extensions cords carrying death to each Eldorian member left, leaving only the wooden sentinel.\n\nFrom within the reservoirs of her soul, Filuent felt the tugging deep inside her mind, for all the efforts channeling into Ilya’s experience, there was only so much mana she could provide. While Eldor on the other hand seemed to have limitless reserves. They were likely pulling it from the Orcobras cluster that surrounds them. Even if Orcobras hasn’t reached its activation requirement it still accepts and holds mana. A cluster this large would have seemingly limitless reserves even if it was only at ten percent compacity, but they would need some kind of system to reach out and pull the mana from the crystal deposit. How they were doing that, was a mystery she had yet to solve.\n\nAnd she never would, as her thoughts rapidly came to a halt from rupturing words that echoed across the chasms of her mind. Raw pain would consume her as her thoughts were overshadowed by a voice of imposing will. All the remaining 14 members of the Visuden strike force heard the words of the last remaining enemy from deep within their minds.\n\n“Patients of freewill. In events proceeding present, predecessors of these lands sought to undo all binding threads of choice. Although your kinds betrayal has once again put thee onto a path that lay without autonomy. Let this trial serve as your readiness to walk.”\n\nFiluent shuttered from within her white silk cloak as she looked through the window to the ice aquarium which housed the wooden sentinel. A minefield of chaotic ice fought against the fast-moving currents; the mana froze in unpredictable sections of the oceanic depths beneath the prison’s surface. But such shackles were only temporary and in time the Archon rose to the top of the newly formed glacial terrain. Liquid currents spiraled around it, and the film shattered as it reached the pinnacle and passed through the layer seamlessly.\n\nWater production from behind had almost entirely been halted, likely readying again for a shift in element. The sentinel stood at the peak of the elevated land just past the barrier. It waited, giving the heroes the first move.","timestamp":"2023-12-07T05:16:01.857000+00:00","edited_timestamp":"2023-12-07T16:34:37.017000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"805258758477316097","name":"NianShake","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0},{"emoji":{"id":"718885348758913064","name":"woolroll","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":19,"userName":"kyroscript"},{"id":"1186061632787468298","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter's group perked up when they saw light at the end of the tunnel, they must've been right before the enemy's domain. The sad silence lingering in the air was both comforting and telling - their last offensive must've done considerable damage. The chill in the air ate away at their stamina, but they pressed forward, shuffled really, onwards. \n\nOctavia and Julian took turns carrying their last explosive shell, and it was Octavia that began pulling the pins and spinning the dial on it as the light stretched over their muddy boots.\n\n**\"Let me,\"** Julian offered, with a shaking arm.\n\n**\"No need,\"** Carter shook her head, \"**Gray will make sure this reaches him. And I'll make sure he doesn't get off free from it.\"**\n\nThe three peeked from the hole of the tunnel - staring at the figure standing at the edge of the massive ice platform. There wasn't ever going to be a better chance than right now. \n\nIn the end, they decided to let Julian throw the shell bomb anyway - letting it sail over an admirable distance before a burst of air - weak, unnatural, tampered - came forth from their feathered companion's wings, allowing the shell bomb to cross the distance, falling neatly overhead the wooden sentinel. \n\nAnd Carter herself dashed over, sliding over on the ice platform, her form solid, cape fluttering all the while, with her both spell canons cocked, firing a blistering torrent of silver flames. Her target - the sentinel? Not quite. She aimed for the shell bomb falling over head the sentinel - the perfect secret ingredient to set it off early, and ensure a hotter and flashier explosion without disturbing the icy efforts of their team down below.","timestamp":"2023-12-17T21:45:29.216000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":20,"userName":"_coiiapse"},{"id":"1186140854281314395","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Once she was sure there weren't any more movements in the disgusting water, Ilya relaxed her control over the magic array. Following her lead, other mages also stopped their supply. There was still enough power within its circles to keep the wall up, but only for a few minutes. Ilya looked up past the efforts she and her fellow mages have just created, at the sentinel.\n\nAs the figure spoke, Ilya noticeably felt the Visuden allies become more enraged. Understandably so, the last several minutes just saw tons of losses, and their enemy simply called it a trial, pretending to be some cult leader. *Well, they probably are a cult leader,* Ilya thought to herself. As for Ilya, she remained silent, both out of exhaustion and anticipation.\n\nAs she racked her brain to find out just what this seemingly self-important person is scheming, she watched as Carter's team commence an attack. With that, Ilya just readied herself to cast more spells.","timestamp":"2023-12-18T03:00:17.092000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":21,"userName":"alteras"},{"id":"1187223864787353620","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Turns of an Archon\n\n**Prelude:**\nBy heroic efforts a metal shell sored overhead violently seeking its destination, from a distance the sentinel briefly observed. It watched patiently waiting for Carters shots to impact the catalyst and send a trail of blazing decimation across his location. \n\nAnd it did, the ravenous fire took to melt the ice which it stood on and cover the area in heat. After a time, the lit flame receded into smoke and cinders, then from the wreckage the archon stepped forward. \n\nScares of flame lay evident on his body like graphite never truly erased from the paper. He had taken the hit, but the damage was simply too miniscule to leave notable alterations. The sentinel stepped forward, what would unfold next was a symphony of complexity and potency that would rival even the most exaggerated stories the bards would tell late into the nights.","timestamp":"2023-12-21T02:43:46.918000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":23,"userName":"kyroscript"},{"id":"1187223923104952370","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"https://www.youtube.com/watch?v=lkicMsn-s_8 (Never a bad time for boss music)","timestamp":"2023-12-21T02:44:00.822000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[{"type":"video","url":"https://www.youtube.com/watch?v=lkicMsn-s_8","title":"UNDEAD CORPORATION - Everything will freeze","description":"Title: Everything will freeze\nCircle: UNDEAD CORPORATION\nArtist: パインツリー (Pinetree)\nGuitar: パインツリー & KOUTA\nAlbum: 暴君 (Tyrant)\nOriginal: フラワリングナイト (Flowering Night)\nGenre: Melodic Death Metal","color":16711680,"author":{"name":"AquaLugia","url":"https://www.youtube.com/channel/UChzdd8deStbvsLtCp26Ki3Q"},"provider":{"name":"YouTube","url":"https://www.youtube.com"},"thumbnail":{"url":"https://i.ytimg.com/vi/lkicMsn-s_8/sddefault.jpg","proxy_url":"https://images-ext-1.discordapp.net/external/-aOG-MxZuiF5UtW6a0BqWsE_CchnoSCiTBkmACdj8ss/https/i.ytimg.com/vi/lkicMsn-s_8/sddefault.jpg","width":640,"height":480},"video":{"url":"https://www.youtube.com/embed/lkicMsn-s_8","width":1280,"height":720},"content_scan_version":1}],"pinned":false,"type":0,"flags":0,"components":[],"position":24,"userName":"kyroscript"},{"id":"1187224014893101156","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Turn 1:**\n\nShock ran through Filuent as she felt the shift in mana again. From the mental poles that reached floor to ceiling, current began flowing. That was it, that was how they were drawing the mana in, she was sure of it. The poles must reach out from the center to the Orocobras around them and pull in the mana to the source of their enemies encampment. Which meant that it was about to fire again.\n\nAround the sentinel a force of energy unseen to the naked eye sought its way into the wooden body. Paths of displacement flowed into the doll until it was rich with the will of the world, its source different from those our heroes drew from.\n\nFiluent watched from below in disbelief as it stepped forward, gently pierced the film of the barrier, sliding through the complexly weaved lines delicately cast by Ilya’s hand. As its finger crossed to the other side cracks of devastation jetted out from the incision point to the outer edges of the cast, eventually shattering the abandoned barrier into pieces. \n\nFrom the artificial limbs of the enemy sprouted the form of wooden animals of flight. Starting with the center, their form was quickly filled in until four wooden birds lifted from its body and began circling above the Visuden force. \n\nAfter a time, the bird vanished, but Filuent could still feel their presence, it was obvious the birds still sought the group’s annihilation. Slowly charging a spell of total destruction. Although she could not see them, the bird flew in erratic patterns. Without knowing their exact locations, it would be difficult to hit them.\n\n“Seek not to spend effort, for the shades of flight cannot be touched unless shrouded in shadow, and by an attack not comprised of mana.”\n\nFiluent felt stress shoot through her. The bird were entirely invincible unless covered in shadow and even if they could cast a shadow to reveal the birds, they were immune to any attack she could create. \n\nThe sentinel pointed to Ilya, and spirals of lines formed an arrow above her head and a circle around her. The circle slowly dissipated in a clockwise direction, illuding to the activation of a spell which sought to crush her. At the current moment, she felt a great weight pulling her closer to the ground making her barely able to stand. \nFiluent stepped within the circle to keep Ilya from falling to the ground, and the weight which pulled Ilya down was shared with Filuent.\n\n“Seek not to bear the trouble alone. But remember that in the darkest time, despair shall find thee.” \n\nAt that moment, Filuent could no longer see anything from her eyes. At the origins of the previous barrages a new element poured forth to lay its claim, darkness. That which would reach to every corner of the tunnels in an instant and blind every member who used their eyes to see, devouring all light from the land. Limitless reserves poured from its point of beginning. And while it pressed forward, the birds of construct became malleable once again.\n\nQuickly in response, the mages sought to cast light magic around the party, Filuent included. The shadows around them backed off, while the efforts of their light continued to drain them. But their success would be ill afforded. One by one those around her stopped lending their strength as the light dimmed. Eventually, it was her turn. Deep within the synapsis in her brain a fear unlike anything she had felt before came to her, and in that hallow night there was nothing but the scripts of emptiness. Filluent and all other members that weren’t immune to powerful mental effects fell to the ground. \n\n“There is no hope.” Filuent echoed in unison to others. \n\nBlind in body and mind, Filuent willingly accepted the threads of energy when they came to bind her. Cutting into her arms and legs, those effected by the spell of the mind were tethered to each other in a prison of web created by the sentinel. Forced into a position of prayer, each waiting to die.\n@gabbie0w0","timestamp":"2023-12-21T02:44:22.706000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"179260464956440576","username":"gabbie0w0","avatar":"733fb651107eec3a4a024a017c0d3186","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Gabbie","avatar_decoration_data":null,"banner_color":null,"clan":null}],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":25,"userName":"kyroscript"},{"id":"1187489845099122839","channel_id":"1167917480249929819","author":{"id":"179260464956440576","username":"gabbie0w0","avatar":"733fb651107eec3a4a024a017c0d3186","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Gabbie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The darkness deepend around the heroes. Deeper than dark, deeper than magic, deeper than *deep*. So dark that not even the Abyss dared stare back.\n\nAn ice-cold grip spread throughout the battlefield as this happened, as cold as the frozen deserts of Giryth. Puffs of vapour, invisible due to how dark it was, made evident the fact that it was incredibly cold. The feeling spread like a virulent plague, greedily stealing away any mote of heat from the environment and replacing it with absolute stillness. \n\nThe birds cawed aggressively at the new sensation, but their bodies shrivelled up within seconds and fell to the ground, shattering in a thousand pieces as their frozen corpses impacted the stone pavement. The wooden automaton's joints were struggling to move, as ice began forming on its body, the humidity in its wooden frame solidifying.\n\nEveryone in the room could feel their minds being observed, watched attentively, like a hand browsing curiously through a book - every single emotion, thought, ideal, opinion, their memories, their core values, all overviewed by a hungry eye.\n\n_Hmm... Despair._\n\nAnd delicately, gently, as though to provide cold comfort, the overviewing eye left the heroes, taking the despair with it. Freeing them of its hold, as if it had never been there - despair, and memory of it, gone in an instant.\n\nA voice spoke in all of their minds. \"**Entertain me, heroes. Don't let your offering be for naught, lest I change my mind.**\"\n\nThe binds were cut by an invisible force, their wounds healed by what could only be described as a 'slimy feeling' from within their soul being forced out to repair their corporal forms.\n\n@kyroscript @alteras @reinhardt @_coiiapse @_churl_","timestamp":"2023-12-21T20:20:41.566000+00:00","edited_timestamp":"2023-12-21T20:22:44.919000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"108757318849531904","username":"reinhardt","avatar":"813677b2ff03227a8e1268244a07f228","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Reinhardt","avatar_decoration_data":null,"banner_color":null,"clan":null},{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},{"id":"340862894998683658","username":"_churl_","avatar":"ba9ad4e045709e0b6cc88eff17b3022a","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Churl","avatar_decoration_data":null,"banner_color":null,"clan":null},{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null}],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":27,"userName":"gabbie0w0"},{"id":"1187830087001841684","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From shattered remains of bark components thought unmade, new life took form again. Devastation brought from the mind would only continue a cycle of rebirth anew. As these shards clumped again together, they altered to a chrysalis shape, and in brief moments new life sprouted from the cocoon. Like phoenix built of reused parts the four birds went to the skies again and began their charging once more. \n\nMeanwhile the sentinel on the elevated plain of ice continued to freeze. Although his body took almost entirely to ice, the creature seemed stubborn to accept its now immobile form.","timestamp":"2023-12-22T18:52:41.557000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":28,"userName":"kyroscript"},{"id":"1187998448331538502","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Ilya steadied herself as she witnessed the attack land on the being. Immediately sensing the failure of the attack, she readied a salvo of ice shards, only to be interrupted by the sudden change in the air. As the mana around them warped, her face hardened. It became increasingly clear that this was going to be a hellish fight.\n\nThis sentiment was almost immediately confirmed by the figure's next actions, shattering the barrier and creating more *monstrous things*. Before Ilya could react to the birds that flew around, she felt an incredible weight upon her. Struggling to regain her footing and barely being supported by Filuent, she saw the mark above her form. Hearing the enemy's words, she instantly knew she was not in a good place. Still she had just enough leeway. Her fellow mage's lights chased away the appearance of the wooden birds, but in her mana stained eyes, she could see them just fine.\n\n\"Carter! Eyes—\"\n\nAt the moment, the web of despair was cast over them. Ilya, already in the difficult position of maintaining her stance, felt the weight of hopelessness. Her dreams of exploration and adventure, her love for magic, her admiration for the world, all suppressed by an unnatural force. But quickly such feelings was dispelled and replaced by an unnatural feeling.\n\nRegaining her focus, Ilya wanted to identify this unknown interloper, but the sound of the birds clattering back to life from beyond the darkness drew her attention back to the battle.The world around was cloaked in darkness, but with her magic vision, she could make out everyone's figures. With shaky arms straining against gravity, she raised her left hand in the direction of Carter and several gunners.\n\n\"Eyes of Truth!\"\n\nSoon other people's eyes began to glow with sigils of blue mana, with a magic circles appearing before them. But before Ilya could cast some more, she slipped onto the ground, dragging Filuent down as well.\n\n\"Ugh! Mages! To me!\"\n\nRealizing the mark upon her will soon unleash, she decided to call as many people in to form a combined defense. *If the bastards words are to be believed, I'm gonna need more than our poor soldier-mage here.*","timestamp":"2023-12-23T06:01:42.026000+00:00","edited_timestamp":"2023-12-23T16:32:13.939000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"812208475639513099","name":"ZoomEyes"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"585890106750140434","name":"taxes"},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"851188341621653514","name":"GravelShake","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":29,"userName":"alteras"},{"id":"1189392059669434459","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter clicked her tongue in frustration seeing the wooden sentinel walk free and untouched from the shell trap, however soon enough frustration withered and twisted to a heavy lethargy, a disease eating at her mind, taking fiery pride, and flamboyant passion from her mercilessly - just as the silvery fire licking away at the icy platform withered and waned with the arrival of a cold fellow\n\nIlya's last cry amidst the chaos was all the warning she would get before the bleak world around spun away, and crystal clarity was afforded to her eyes. The oppressive gloom in her soul pulled back, allowing her to take her first full breath of fresh air. \n\nIt was not hard to interpret the truth that Ilya's magic presented to her - these birds were magic manifest themselves, it would appear. Were she a better magic practitioner she would welcome the challenge of using magic anyway - but she understood the tools of her trade far better.\n\n**\"Octavia - Sniper Rifle!\"** Carter requested, and noticing that Ilya's magic had also reached them she rejoiced, **\"Eyes front - we're crawling in the dark, coordinate the frontline-\"** Carter took a moment to catch a high grade sniper rifle delivered from Gray's talons, ejecting the rounds loaded to snap her own heavier rounds in. **\"don't let anything take the mages off guard.\"**\n\nWith the two gunners breaking off from Carter's position to better shout at their fellow soldiers, Carter threw her hat off and settled down, bracing the sniper rifle against her form, arms taut, scope lined forward. \n\nIlya's magic was a boon in helping her to find her targets - and Carter was wary enough of the birds that could effortless reform that she had a feeling one shot wasn't going do as much damage as she needed too. Adjusting the scope to better track them all -\n\nCarter double tapped the first bird, but didn't linger to see what happened after, making miniscule, minute, adjustments to the next bird and double tapping the next three in a similar fashion.","timestamp":"2023-12-27T02:19:24.861000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":30,"userName":"_coiiapse"},{"id":"1189392081962160218","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Forcing the explosive rounds had its disadvantages - lower magazine, heavier weight - but with her eyes touched with magic, slower hands were a necessity. Utilizing the scope to its maximum potential might even cause motion sickness. Once all 8 shots were fired, Carter leaned away from the scope - her eyes immediately strafing towards the immobile sentinel before all else, eager to find a soft spot for her next fiery shot. \n\nBut she couldn't help but frown as the the ice creeping upon the wooden sentinel - courtesy of the new arrival - remained a mystery from her magic stained eyes. It seemed that it was far more helpful to let the wooden sentinel fight its way out from the icy grip than anything else. \n\n...\n\nMeanwhile, Octavia and Julian peered from the edge of the icy platform, ordering the melee soldiers, those with shields, to splinter into groups of 4, taking care of every side of the mages and Ilya who was eating dirt at the moment - readying themselves should assassins strike within the dark veil. \n\nHowever, three of the soldiers broke from their groups - many began to cast fortifying spells onto themselves and their shields, allowing the three soldiers to kneel and grab at the two mages who had fallen to the ground. Their strong arms went under and began to haul them by the pit of their arms, grunting as they had to fight the artifial gravity to even bring Ilya to her knees - was she even in a condition to continue casting spells as she was? \n\n**\"No good - that curse is going off-\"** One of the mages trembled, eyes glowing from Ilya's magic. \n\n**\"Replicate the shield and steel skin spells we use,\"** The frontline soldiers said breathlessly. **\"Ours can be layered.\"** Before he was even finished - more than mage had began to cast onto them, and the others standing several steps away turned to follow their lead, making sure everyone around had even the most basic of protections.","timestamp":"2023-12-27T02:19:30.176000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"616963786045390868","name":"ExusiaiPewPew","animated":true},"count":3,"count_details":{"burst":0,"normal":3},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":31,"userName":"_coiiapse"},{"id":"1190832920416485486","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Endings:**\n\nCloaked in the shadow of mortality, the tungsten component of a high explosive round clipped into the incendiary mix near the tip of the bullet as it passed through the fluttering wood. Blessings of precision lined the bullets pathway of steel, opening holes of flames and deconstruction from the core of the creatures to their exterior. \n\nThe energy of their charging spell dissipated into the air peacefully and the broken remnants fell aimlessly, sinking into the ground below and vanishing completely.\n\nThe marker around Ilya rendered its finale and all those within the circle felt a shockwave that pulled them briefly to the ground before the spell vanished. \n\nA weight that would easily have severed every molecule of Ilya’s flesh container into the ground. But with the help of those around her and the protection spells, the energy was split equally among them, and the attack was no stronger than a forceful push. Afterward the arrow and any markers around Ilya dissolved.\n\nThe Sentinel stepped forward from its ice prison, light pieces of his outer shell tore off in the process. Whatever foul material made him was taking damage, and thanks to the efforts of an unknown guest, each hero had yet to fall. The director rose its hands again, preparing to being the next act.\n\n**Turn 2:**\n\nVoided air entered Filuents deprived lungs just after she realized the spell had ended. From below her, slivers of saltwater left her and from her depths what came back were the shades of her life as a Sister. \n\nThe prayers of all those she comforted in sacred halls of religion presiding in the lower income of Lithos. Those whom she sacrificed her life with, for the promise of prosperity. An act that her death here would render meaningless. For the sake of them and every other life in Lithos that would be effected should they fail, she stood up again.\n\nIn the distance, shadows created from the Eldorian headquarters stopped. A shift in current from the metal poles signaled a sequence of change. Another element was coming at mass. \n\nBy the hands of the Sentinel, cracks formed from the ground beneath the tunnels. Roots of a tree lifted into a sprout and budded a docile sapling. From the center of the tunnels the tree formed, and with their enhanced vision they would see large lines of symbols on the ground that covered to the edges of the tunnels and grouping each direction to a symbol.\n\nTo the north was the symbol of lighting, south was water, east of fire, and west of light. Then spoke the voice which all had come all too well to recognize. \n\n“From the depths of the center there shall be a great purge. For this calamity, you would choose your element of shield. Know that for this time, what has come via the origin shall not repeat.”\n\nThe carbon components of its host screamed as the sentinel drew more strain upon them. Pieces of his body broke off into seeds. Bursting forth hallowed forms of wooden supports in the husks of deer. \nFrom within the blueprints filled in a construction identical to the bird’s formation. \n\nEach of the four animals stepped forward pointing their antlers toward the sapling. A light of corruption connected them and began withering the hero’s seed of salvation.\n\nFor the last segment of the sentinels attack, near the feet of each of the fourteen remaining members formed arrows of binding will, pointing in a direction. Half of the arrows pointed north while the other half pointed south. \n\n“These show the destiny of your destination. On to where thee shall walk when the shield is placed.”\n\nFrom Filuent's position she lifted her hand into the air and beams of light rose into the top of the tunnel clearing any lack of vision they may have had before. It was clear what they need to do next would require a unanimous team effort.","timestamp":"2023-12-31T01:44:52.833000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":32,"userName":"kyroscript"},{"id":"1192921460604403864","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The curse of the Sentinel had been softened, but that did not prevent echoes of its effects from bouncing around the tunnel walls. From where Carter stood, it sounded a touch stronger than any mere push, drawing her attention away from the Sentinel who was slow to act, it's spells taking far longer than any of Ilya's to manifest in full - due to old age or unique constitution, she dared not ponder for too long. \n\nOctavia and Julian had long clambered down the ice platform, shoulders and knees taking bruises along the way to help the closest soldier to their feet. Carter followed suit - with far less bruises along the way, with an iconic fluttering of her cape to accompany her descent. She ignored any splashing and ghastly sounds from her boots a she strode to Ilya with sympathetic eyes, yet ... \n\n**\"We need to organize an offensive. I can take most of the rank and file - but can I leave the mages to you?\"** She proposed, and with a quirk of her lips, she reached out to swipe Ilya's hat — but before her hands reached her prized, she was ripped away by some phantom force. \n\nThe world spun and shook - bright lights burst from every corner that would've disoriented the common person. But Carter was calmly watching as the events unfolded, her eyes still bleeding, spinning with magic energy from Ilya's earlier spell. The grand tree in the center drew her ire and frantic hunger - immobile, defenseless, a threat, something to burn and set ablaze. But her feet led her down another way to where crackling of lightning drummed dimly in her ears.","timestamp":"2024-01-05T20:03:59.617000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":33,"userName":"_coiiapse"},{"id":"1192921464618356867","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Lightning brightened and roared as a companion manifested - a deer, its antlers and hooves dipped in magic, trotting this way and that, but ultimately setting its unliving gaze upon the gentle sapling and charging, howling in a way no deer should, as if calling all of lightning's wrath to join in its hunt. \n\nCarter immediately unholstered one of her spell canons, nerves set alit, as if in unison with the howls of lightning, and aimed - not to find a better line of sight, but to let a massive silver fireball grow at the mouth of her spell canons, allowing it to blister and spittle before firing it down at the deer, answering its challenging cries with all due respect. \n\nOctavia and Julian paid close attention, shouldering their rifles and ready to follow Carter's lead - but a sharp bark from Julian kept them from firing. There was no way of knowing what would happen if the deers were hit. Better to wait and see if something horrible would become of the cooked deer first.","timestamp":"2024-01-05T20:04:00.574000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":34,"userName":"_coiiapse"},{"id":"1192978490979520604","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Ilya watched as Carter, and everyone else, began a march to opposite sides. Ilya for her part was also marching, tired and damp from having just survived a gravity crush spell. Wishing this trial would end, she exhaled a troubled groan before yelling out an acknowledgement to Carter's proposed chain of command.\n\nAs Carter and the gunners destroyed the wooden deer, Ilya focused on her legs. With the force marching, any attempts to move to safety would be unsuccessful, much less any regrouping. Looking around at the remaining comrades, it'd be troubling to use any magic to forcefully move everyone to one space. Instead, Ilya turned to the magic pouch by her side, as her march brought her closer to the edge of the arcane sigils she stood on. Knowing her equipment as well as any Pathfinder should, she quickly found rope of the highest strength. Pulling one end out, she wrapped it around herself before pulling more length out.\n\nAfter pulling a seemingly impossible length out from the small pouch, she tossed the bundle to the person nearest to her and repeated the same.\n\n\"Tie yourself to the rope and pass it to everyone! Get us to the water sigil! Mages, prepare burst kinesis spells!\"","timestamp":"2024-01-05T23:50:36.718000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🌊"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🪢"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":35,"userName":"alteras"},{"id":"1192994367758151802","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Among Ilya's group, one particularly strong armed individual - and none too shy about it - was handed the rope last, for he had quite the important task to fulfill. Rolling his bulky shoulders, his hands gave the Guild of Heroes Pathfinder Rope ™️ a firm squeeze, judging its weight, and finding it unique in its sturdiness, he felt far better about their chances of saving their comrades over on the other side. \n\n**\"Any time now, Cohn.\"** The nervous mage at his elbow griped, and Cohn Jena gave a solemn nod before his torso twisted, arms pulling and snapping with an explosive power, sending the Guild of Heroes Pathfinder Rope ™️ torpedoing from their side over the distance to where their comrades were. Nothing less was to be expected from the man with the strongest arms in the platoon. \n\n...\n\n**\"Double time it - the mages can't afford to wait an extra second,\"** Octavia ordered, as she plucked the Guild of Heroes Pathfinder Rope ™️ from the air, deftly tying a knot around herself before handing it over to the next person beside her. **\"It won't be gentle either, steady yourself or get ready for a face full of dirt,\"** she added as she peeked over her shoulder, eyes dripping with Ilya's magic, still, watching the fabric of magic come together from their mages - far more violent than anything before.\n\n**\"Julian, the left-\"** Carter called,  and was answered immediately with the bark of his harsh rifle blasting the deer under a halo of light to his left with volleys of piercing shots, intent on ripping it apart from head to tail. Neverminding the unknown consequences of outright destroying them for now. Carter had one hand securing rope around herself, tightening it firmly and pulling the trigger on her spell canons at the deer to her right - and hopefully the resulting explosion from the clash of fires would be all the indication Ilya needed that they were ready to be bailed out.","timestamp":"2024-01-06T00:53:42.037000+00:00","edited_timestamp":"2024-01-06T00:54:56.636000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"💪"},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":36,"userName":"_coiiapse"},{"id":"1193022412007161857","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"As the rope was passed around, Ilya and the mages were gathering mana, forming the necessary images in their minds. Mana of varying colors wrapped around the part of the rope leading to Carter's group, as if ghosts possessing the objects. Similarly, those without magic gripped their portions of the rope like sailors readying a ship's sails. Their minds were one.\n\nThe moment the sounds of an explosion was heard, all of them released their tensed strength. The rope took on a life of its own, pulling wildly towards the center of the water sigil area. At the same time, those with more physical strength yanked hard on the rope, pulling those along it toward the center.\n\nIlya and a few others close to the edge of the area jumped lightly, losing their hold on the ground, allowing themselves to be ungracefully pulled back. As she struggled to land herself, she looked up to confirm everyone on the other side was gathered over. Seeing it was done, she reeled in as much of the slack left back into her pouch.\n\n\"Lock arms and keep us in center!\"","timestamp":"2024-01-06T02:45:08.307000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🌊"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🪢"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"609434433132560387","name":"Whip"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":37,"userName":"alteras"},{"id":"1193680687098773504","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Endings:**\n\nWith the fourteen members laying within the south sigil, the destruction of the deer complete, and each member bound to each other, the stage was set. The nurtured sapling sang with energy and listened to the choice of its audience. \n\nThe branches grew rapidly and reached limitlessly across the group forming the foundation for the shield. Filuent looked up to see water pour from the wooden limbs of their protector. Around them it formed a dome of boundless liquid. \n\nLifting from the ground, the Sentinel floated aimlessly. Silently waiting, there was an overly long period where both sides simply watched each other, patiently awaking the outcome.\n\nFiluent looked above her to see the massive ripples in waves from the shield over them, like the ocean, long stripes of lines crossed from one end to the other. After a frustrating amount of time, Filuent closed her eyes and hummed to ease her overbearing thoughts within the tension that had built…\n…\n…\n…\n…\n\nFrom the shadows of a corridor unseen, a furious insatiable blaze consumed the land. From the deepest chasm of the tunnels to the highest tip of the structure, flames ingulfed all. As the waves of fire passed over the glacial plate it incinerated the molecules in moments, leaving the Sentinel to slowly float down to the ground beneath him. \n\nFiluent saw as the carnage passed violently over their protection. Shockwaves of red and blue shook over the barrier several times hitting their protection relentlessly. With each hit the branches grew weaker. Larger pieces of the sapling’s wings broke off, falling to the ground and vanishing into ash. Just before the dome would fall the flames ceased and the saplings arms retracted again to their former self. Shortly after, the arrows of the forced march vanished, along with any influence they held over the heroes.","timestamp":"2024-01-07T22:20:53.319000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":38,"userName":"kyroscript"},{"id":"1193680728551067729","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Turn 3:**\n\nHovering to the ground the Sentinel briefly collapsed into a kneeling position. The wear of separation pulled harder more against its form. There was, however, still more to be done.\nRaising its hand, a disturbance of the mind shook through the group. From within each of them a brief moment of lapse took from them their concentration. That in the deepest recesses of their mind the sentinel invaded their private moments. That in their most comfortable memories he was watching, studying their very essence.\n\nAnd then it pulled back from the violation of their mind, passing out of their mental and took with it only the knowledge it had gained.\n\nAgain, the Sentinel strained its body once more. Two seedlings like before fell to the ground and formed the husk for new creatures. But as the creatures filled, their shape took a form different from those that came prior. These shades formed into members of the heroes which stood against the Archon. Two wooden constructs which shared the appearances of Ilya and Carter appeared. \n\nBoth the shades began casting a spell that would cover one side or the other. The Ilya shade cast a spell that would cover the entirely of the west side, while Carter cast a spell on the east side.\nOn the ground around the sapling formed symbols again which sought to group areas together. This time however there were four circles with an element both on the outside of the circle and on the inside. Two circles were grouped on the east side, and two on the west.\n\nThe northeast circle had an outer circle of earth and an inner circle of darkness.\n\nThe southeast circle had an outer circle of water and inner circle of earth. \n\nThe northwest had an outer circle of light and an inner circle of air. \n\nThe southwest circle had an outer circle of light and inner circle of fire.\n\n“Again, shall the element from the center not repeat. From the east and west your shades shall cast spells that consume the area accordingly. Their spells are protected against by the outer circle, while the inner circle shall protect you from the destruction brought after.”\n\nFor the final motion the Sentinels had brought upon Ilya and Carter more symbols of nature. Above Ilya’s head formed a black arrow and on Carter formed a single green arrow.\n\n“Whatever circle the black arrow stands on shall be reversed. While the green arrow shall copy the circle of a one clockwise to whatever it stands on, by however many arrows.\n\nMana flowed to the center of the tunnel preparing for another element to make its way down the tunnel. The Sentinel stepped forward to ensure that the shades would complete their cast without being destroyed, he would willingly take the brunt of the damage for them.","timestamp":"2024-01-07T22:21:03.202000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":39,"userName":"kyroscript"},{"id":"1193680776609407126","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"https://youtu.be/ms1_fL1eJ-o?si=dLHaZxJ4_1dACwTP (More boss music)","timestamp":"2024-01-07T22:21:14.660000+00:00","edited_timestamp":"2024-01-07T22:21:25.324000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[{"type":"video","url":"https://www.youtube.com/watch?v=ms1_fL1eJ-o","title":"FFXIV OST 3.4 Boss Theme ( Revenge Twofold )","description":"Video showing the final boss of Xelphatol with a new DUNGEON BOSS THEME PRAISE HYDAELYN THE SWEET MERCIFUL MOTHER. I loved the old Heavensward Boss theme but my god I've heard it enough now. Thanks Soken.\n\nFind the rest of the FFXIV OST here!\nhttp://www.youtube.com/playlist?list=PLL5mKr-nFprKMsrDqpwsI1L0FKj4KgouH\n\nYou can purchase Final Fantasy ...","color":16711680,"author":{"name":"Mekkah Dee","url":"https://www.youtube.com/channel/UCseSrjMOT33IynASXg7oDWw"},"provider":{"name":"YouTube","url":"https://www.youtube.com"},"thumbnail":{"url":"https://i.ytimg.com/vi/ms1_fL1eJ-o/maxresdefault.jpg","proxy_url":"https://images-ext-1.discordapp.net/external/20ps439f6LHQNBv_IetK7Fc5uOQcUaGSQ_kkycYT8nc/https/i.ytimg.com/vi/ms1_fL1eJ-o/maxresdefault.jpg","width":1280,"height":720},"video":{"url":"https://www.youtube.com/embed/ms1_fL1eJ-o","width":1280,"height":720},"content_scan_version":1}],"pinned":false,"type":0,"flags":0,"components":[],"position":40,"userName":"kyroscript"},{"id":"1197523563201175602","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"With the forced march coming to an end, Carter gave a yelp as she was lifted off her feet, the rope still being pulled by the hardiest of their troops. By the time she untangled herself from their formation, the Sentinel had reached the ground, and she had only a moment to wipe the sweat off her brow before a ghostly intrusion was felt in a deep corner of her mind. Dread already began to well inside - there was nobody to save them from another demoralizing state, unless Ilya ...\n\nBut what came after the mental intrusion was something they could fight. Or at least avoid. \n\nBefore the Sentinel was finished explaining the first part of this puzzle, everyone on the East side of the battlefield ran for the water bubble with a renewed sense of confidence. A disgruntled Carter could only sweep her hair with a huff, it was hardly her fault was so *predictable*. Many of the troops probably had the right idea - Carter's spell canons would never possibly bring upon a continuous hellfire like the one they experienced moments before, and she wasn't about to drop a comet on their head either. \n\n**\"Shields. Take the front and mind the top,\"** Carter instructed, **\"the barrier might keep the fire at bay but some of my dirty tricks might have been copied over.\"**\n\nJust as she was about to turn to the gunners for separate instructions, a green arrow formed overhead.","timestamp":"2024-01-18T12:51:06.379000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"954513457305223198","name":"MintCryCross"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":41,"userName":"_coiiapse"},{"id":"1198138499187093604","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Ilya groaned as she watched the flames roll overhead of the group. She was tired and could only watch in reluctant awe as if it were a simple lightshow. As it came to an end, she returned to her task of rolling in all the loose rope back into her pouch. It was clear now that the forced march was over, leading everyone to untie their end of it.\n\nThe disturbance made Ilya flinch, stopping her work, before releasing it's hold. She grimaced as she thought about the various possible meanings such an intrusion had. But the words of their enemy made it clear such knowledge would be the next stage of their trial.\n\nAfter looking at the sigils on the ground and the arrow above her head, Ilya started a quick, albeit reluctant, jog to the sigils of light and air. Dragging the still loose rope behind her as she resorted to stuffing it into her pouch without care, Ilya huffed out a cry of annoyance.\n\n\"Ugghhhh... If this fake me actually had my personality, she wouldn't force the original to run!\"\n\nJust for good measure, she casted a small barrier around herself.","timestamp":"2024-01-20T05:34:38.543000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🧼"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":42,"userName":"alteras"},{"id":"1199532883317116968","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter snarled in frustration as she holstered her weapons, shelved her plans, abandoned the troops, and made haste out of the water circle. She was no stranger to finding higher ground or a better position for her own attacks, but being forced to dance around by the enemy like this wasn't pleasant in the slightest - every second that could've been used to make an offensive so far had been met with endless tricks and terrain maneuvers from the enemy, forcing them onto their back foot. \n\nHow could such a small force with such power have remained in the bowels of Visuden without attracting even the slightest of attention? Given the relationship between the two sides ... had it all been intentional? Allowing an enemy in ... and minimizing the damages with the intention of creating the perfect excuse to retaliate with all of Visuden's military power to wipe out a long hated faction?\n\nBefore Carter's thoughts spun further out, her spell canons gave off heat against her leg. She found herself under the protection of the earth circle, with enough time to vent her frustrations. \n\nThough both feet were firmly planted on the ground, when Carter shot went off, she still slid back a fair bit. The silver fireball soared towards the Sentinel, growing in size, spinning wide, loosing its original shape as it landed at the feet of the Sentinel with a heavy impact - but the real damage would come from the geyser of silver fire that then erupted as its feet, wildly lashing at the Sentinel trapped within the confines of a fiery tomb.","timestamp":"2024-01-24T01:55:25.626000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"645033969275895824","name":"PogChomp","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"613476186374275080","name":"MG4","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":43,"userName":"_coiiapse"},{"id":"1201400545424973927","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Endings:**\n\nA foreboding breeze sifted through the tunnel giving alliance the coming torrent of air that was soon to be. A star of fire from Carters shot rang across the field. Its flame and passage cut the battle in two. \n\nThe bullets’ explosive range threatened to damage the Sentinel and all around it. But holding believe in its trial the Sentinel opted to protect its construct above its own live, taking the shot in its entirety. \n\nThe bullet light lashed out against its prisoner slicing through its wooden components taking with it the Sentinels right arm and whipping its body repeatedly after. Cracks ran down its now wanning form and the rising smoke from the destruction lifted to obscure the Sentinels location.\n\nMeanwhile, the symbols above Ilya and Carters heads dissolved. Each doing as described before. \n\nIn the correct locations both of them had stood. \n\nTo Carter, her circle copied that of the correct one. Overriding her own to form into that of water and earth. To Ilya, her circle reversed the elements of air and light, to that of earth and darkness. Just before the havoc began a shadow jumped into Ilya’s circle to take part in her success.\n\nIlya and Carter of imitation stepped forward to take the stage, while the circle of protection lifted their element around the chosen. When the fake constructs fired, two elements consumed the area and divided the land in half. On the side of fake Ilya a spell of light covered the left, while on the side of fake Carter, fire did the same. \n\nThe shields of water and darkest held easily against these and as the spells dissipated earth lifted from the ground to protect all. It was then that air would come from the central tunnel as those elements before it had done. A blanket of wind would come endlessly, taking anything without protection and throwing to violently to its death. \n\nAs destruction rained outside, there was only darkness within the earth circles that protected their Litho’s heroes. \nIn Ilya’s barrier a small light from a match provided the slightest bit of vision. As she looked over, she would see Behemoth still alive. His skin was hardened to a shell, no doubt his power to enhance and heal. In this case, enhancing his own skin to be quite tough. \n\n“This thing is one hell of a bastard huh?” The crackling of the earth prism about them made his words barely audible. \n\n“Let’s see if we can’t kill him.”\n\nAfter he said this the air current ended and the earth shield fell. Behemoth stepped into the center to cast a large enhancement on everyone. \n\nA circle of energy reacted over to the party providing healing and a small damage to the Sentinel. The dangerous fatigue plaguing the party would fade for a time and give them strength far beyond that of a normal mortal.\n\nMany of the soldiers looked over to see their commander revived in the flesh.","timestamp":"2024-01-29T05:36:50.972000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":44,"userName":"kyroscript"},{"id":"1201400985139024032","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Turn 4:**\n\nThe grey fumes of ash lifted to reveal the nearly destroy body of the Sentinel. It clenched its remaining arm against the empty shoulder of his disembodied section. Long scars coursed across its form while flakes of wood shattered off its body. \n\nThe creature looked up in frustration and spoke, “Not yet. All will be for naught if thou are unable to manifest thee soul.  To be enshrouded from control.”\n\nThe shades of Ilya and Carter responded to its command. Ilya lifted her staff into the air, while Carter lifted her hand. They intended to enhance the next element of choice. \n\nAgain, the sapling lifted to alter its symbols. This time reverting to an alignment similar to the first, with North, South, East and West. \n\nTo the North was Fire, to the East was Ice, to the South was Light and to the West was Water.\n\nAlong with this, more symbols of familiarity formed above the hero’s head.\n\n“Know that that the element is Light and its power will be too great for any one shield to hold alone. Unify all or face obliteration.”\n\nSymbols of black arrows signaling reversal appeared above Filuent, Octavia, Julian and Carters heads. Arrows of copy formed above the heads of Ilya, Behemoth and Cohn. Ilya had a single green arrow, Behemoth had two green arrows, and Cohn had three green arrows.\n\nWithin the heroes a small spark formed deep within their soul. Though the source was unknown to them, each had a feeling that the order of actions would have the elements copied before they were then reversed.","timestamp":"2024-01-29T05:38:35.808000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":45,"userName":"kyroscript"},{"id":"1206437455230672928","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Ilya turned to the being that appeared before her, giving an exasperated \"Welcome back\" to him. Her eyes miserably spoke of equal parts confusion over his revival and exhaustion concerning the situation.\n\n\"The guy seems to be funneling a ton of external magic from elsewhere, so for now we gotta play his stupid game.\"\n\nIlya turned her attention back to the enemy just as the next round began working itself into the surrounding. Listening to the sentinel talk once more before looking at yet another arrow above her, Ilya scratched the back of her head.\n\n\"I guess I'm first then...\"","timestamp":"2024-02-12T03:11:43.851000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"638338023938981888","name":"GoodNightRed"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":"1093298644062576750","name":"whyucrying"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":46,"userName":"alteras"},{"id":"1206798215584813096","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter waited as patiently as she could inside the shield of earth - she had just mere moments to admire her own handiwork against the sentinel before earth had walled her off from the destruction outside. Once the walls fell, her eyes glanced over the heads all of those who remained - none should have perished from the sentinels tricks this time. \n\n\"Captain!\" A relieved cry broke out from the ranks, followed by other gasps and cheers. Carter's eyes widened hearing them, fearing an illusion, but was forced to accept the timely revival of Behemoth, miserable and pitiful looking as he was beside an equally pitiful and miserable looking Ilya. Whatever displeasures and grudges she held against the desperately-needed-melee-captain she had was soothed and set aside as *something* swelled from within, removing green bruises, and soothing the pain that had started to become uncomfortable in their feet and ankles. \n\nThe mages were worked hard and catching their breath - this reprieve could've only come from the Miserable Captain. Who now sported a green arrow. Poor guy.\n\n\"Captain, can you sort out where we need to go? In the meantime ... I think those puppets he's waving around need to go. Like yesterday,\" she nodded towards the wooden Ilya and Carter at the Sentinel's side, dutifully aiding its creator in whatever deep magic was being prepared. \"Might give us enough time to get into our proper positions.\"","timestamp":"2024-02-13T03:05:15.822000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":47,"userName":"_coiiapse"},{"id":"1207854122779549748","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Light fired off as the synapses in Behemoths cortex began spinning up like turbines to solve the riddle of ever encroaching doom. Four members with reversal, and three members which each copied an element in increasing order and the copying of the element would occur first.\n\nUnbeknownst to him of why, a creeping immunity grew within all the fifteen members dwelling inside the tunnels. A seedling of power ripe to bust and give them their long-needed edge over their opponent.\n\nEven without the help of this growing seedling Behemoth could still solve the riddle. Given that the element was light, they would need to copy darkness to all the tiles. With four reversals, it meant they needed to copy light to each tile first and then reverse them to darkness.\n\nThis they could do if each person with a copy stood however many arrows they had away from the light tile. In other words, Behemoth had two green arrows so to copy light he needed to stand two tiles counterclockwise from the light tile.\n\nThe ground beneath them crackled as he drilled his feet into the surface to create supports. Expanding his body beyond proportions, a current of air began to form as his swelling mass filled up with oxygen. None of those that resided in the area could miss the ear shattering quake that was his war cry. \n\n# “LISTEN!!!” \n\nThe shockwaves of pulsing air cried out.  “ILYA TO ICE! COHN WATER! ONE REVERSE ARROW FOR EACH TILE! EVERYONE ELSE GO FUCKING ANYWHERE!”\n\nCracked air fell into silence while Behemoths body deflated to its original size and he responded by leaping toward the north most tile of fire, preparing to copy light onto it.","timestamp":"2024-02-16T01:01:03.715000+00:00","edited_timestamp":"2024-02-16T02:24:05.266000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":48,"userName":"kyroscript"},{"id":"1215163989856878652","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Ilya half ran with the labored breath of marathoner seeing the last flagpole at the end. As she stepped onto the sigil with ice, she spun around and prepared her book to her left side. Looking towards the remainder of the team, she launched several enhancement spells.\n\n\"... Castor's guidance. Strength of the loyal. Swiftness...\"\n\nIlya continued to cast more and more, building up everyone's abilities. With the captain finally standing among them and morale quickly rising, she was sure everyone would love to go for an attack after this round of magic passed over them.","timestamp":"2024-03-07T05:07:51.837000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":49,"userName":"alteras"},{"id":"1215835850122858616","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"\"SIR, YES SIR,\" Cohn roared with gusto, and his roar was swiftly joined by the remaining troops' roars, their morale peaking, echoing throughout the quaking chamber. \"FALL IN, SPEARS AND ARROWS, AT THE READY,\" he bellowed, planting his own shield at his feet. The shield sunk into the ground without the slightest of quivering, and many more shields followed, beating into the earth like a drum. \n\nCohn's spear flew forward last, and yet blew past everyone's in a blink of an eye, a charging rhino leading the stampede, as it were, right onto the wooden puppet donning Ilya's shape and face. And thanks to the Superior (TM) Ilya's intervention, the spears thrown flew true, sharpened by vigor and renewed hope. \n\n---\n\n\"Filuent - you keep the Captain on his feet,\" Octavia nudged the girl northward, where the Captain was submitted under rings of fire. \"Julian and I will coordinate the gunners on each wing. Carter-\"\n\n\"-is on nerd-sitting duty,\" she finished cleanly, sweeping sweat soaked bangs out of her eyesight. \"Do me a solid. If you aim for wooden-Carter, take out both arms at the same time,\" and with a dramatic sweep of her cape, she was off, vaulting over a overgrown root towards where chill and frost clouded like mist, where every step taken became a splinter on a mirror. \n\nTaking advantage of the exhausted enchanter, Carter's greeting went unspoken. Instead, she snatched the old hat off the mage's head, donning it for herself, before making full use of the swiftness enchanted bestowed upon her, pulling the triggers on her spell canons with no intention of letting up until the wooden-Carter before them fell to pieces.","timestamp":"2024-03-09T01:37:35.807000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":50,"userName":"_coiiapse"},{"id":"1218630935667413002","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Heart of the Lithos’s Tunnels and Eldors encampment:**\n\nAbove a gaping space floated a vast crystal. The metal lines siphoned energy from the surrounding area feeding into it. It was preparing to fire again. Unlike the regular Ocrobras crystals, which functioned like a battery, we found that by continuing to ascend the element it became more akin to a prism. Feeding it limitless mana, the crystal would produce a massive amount of an element of your choice, so long as it was within the eight Ocrobras could hold.\n\nAt this location where all passages underneath the city converged there was a path leading into the ground. In the time that Lithos was originally founded, the colonists did not know why the massive flood spared their settled location, or where the excess water was going. Many years later when Visuden would seek to mine large amounts of Orcobras, the mechanics behind the lands salvation would result in the mine being shutdown permanently at risk of upsetting the careful balance.\n\nAs the miners would come to understand, the cavern beneath the city leads to a location on the surface far outside the city’s bounds. When the flood season occurs the Orcobras reacts to the increased water element and consumes all the liquid until it reaches max capacity. Like a pump, it releases that water at high speeds till it reaches that uninhabited location outside the city’s bounds, sparing Lithos its torment.\nDespite the current dry season, the Orcobras under the city was still ripe with seemingly endless mana, which made it the perfect place for us to set up a testing ground. \n\nUnfortunately, during our development Eldor intervened, they sought to take our weapon from us and prevent the war we were on the edge of starting. They deployed that horrific Sentinel with an elite force that was bound to its will and so we were forced to retreat, bidding our time. Unable to reclaim our weapon, we lay in waiting and sought help from outsiders to reclaim it.\n\n“We are ready on your command Phoe.”\n\n“Go.”\n\nNot moments after the words left my mouth, the strings on the Eldorian puppets were cut. Their lifeless bodies collapsed. More light fired off from around the space reaping their empty husks along with it. \nRaging in panic that they would be unable to fire the crystal once more, the remaining Eldorians ran to the crystal. Attempting to use their own souls as fuel, they sacrificed their lifeforce for the smallest increase in energy. An ultimately fruitless endeavor which did not provide enough energy and the crystal began to power down.\n\nPathetic and disgusting. For the continued thorn in my side, they didn’t even have the decency to died crushed under me. Many of Lithos 1st defense leaped from the edges of the tunnel. Like the pet dogs they were, I needed little words for them to do my command. \n\nUltimately, I lacked their mobility and was forced to walk around the long way before reaching the floating crystal.\n\nAs I made it to the lower floor one of the 1st walked up and bowed.\n\n“We have found a prisoner. He does not appear to be one of the Eldorians and was without weapons. He would not speak of his purpose or who he was.”\n\n“Hm, take him to the surface and question him there, we will get answers from him yet.”\nTurning away I faced my prized creation.\n\n“Ocrobras Prime. The weapon that will cut this peaceful era and wipe Eldor off the face of Melicau permanently.”\n\nLifting my arms up I stood against the crystal, closing it in my embrace.\n\n“The Guild won’t have to deal with anymore waves of magic and based on our reports they have almost finished off the Sentinel.” Ishile said, the leader of the 1st.\n\nDespite wrongfully interrupting my concentration, I gave him a nod. \n\n“It was too much to hope they would take each other out. We should be ready to greet them and retake control over Behemoth. I doubt he will be very accepting of our actions, considering his past reactions.”\n\n---","timestamp":"2024-03-16T18:44:16.131000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":51,"userName":"kyroscript"},{"id":"1218631737999888384","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Endings:**\n\nCurved light crossed over the wooden puppet. Like a balloon popping, 240 cm of raw metal crushed through the fake Ilya's head leaving nothing in its wake. Its lifeless formed fell into the shadows below and instantly turn to ash upon contact. Whatever negative magic created it, formed feedback into the Sentinel and damaged it in return.\n\nTaking the last of her energy Filuent sought to end it all. From the far north tile, she lobbed a beam of light into the abyss at the monster’s main host. Crossing the veil the beam lit the night to its target. Whether by concentration or lack of energy the creature did little to dodge, and to Filuent’s surprise the light evaporated its form.\n\nA sigh of relief ran over her as she believed the battle was won. But when she looked around, the sapling and its tiles remained. In the distance it was Carters fake puppet that perpetuated them, the Sentinel has moved its soul over to the last husk and with that the tiles reacted for the coming mechanics.\n\nIn order Ice, fire, and water were each copied to light. Then the arrows of reversal changed all the tiles to darkness. The shield covered them again, but as they waited more and more time passed, by which the light never came. Eventually the tiles vanished.\n\nOur heroes were unknown to the exact situation, but it was clear that something had occurred at the Eldorian camp. The enemy could no longer send waves of elements down the tunnels.\n\nAmong all you could see the buildup of emotion. For all the pain the Sentinel has cause them, it no longer had its trump card. There was no reason to follow mechanics or care for its words. Behemoth couldn’t help but laugh.\n\n“Kill him!” Behemoth yelled.","timestamp":"2024-03-16T18:47:27.422000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"616963783419756554","name":"IfritFlame","animated":true},"count":2,"count_details":{"burst":0,"normal":2},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":52,"userName":"kyroscript"},{"id":"1227763241195667486","channel_id":"1167917480249929819","author":{"id":"993397722285613087","username":"_coiiapse","avatar":"dbe57749dde8b2b9469958957c5e2e40","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"COIIAPS3","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Carter had no farewell line ready for the old wooden spirit - a terrible mistake on her part, it wasn't polite to end this without one last goodbye, but watching the enemy limp off in an attempt to escape the inevitable just didn't quite stir the blood-lust the way she wanted it to.\n\nFollowing Behemoth's bellow, Carter let loose a fireball from both spell canons. It was not nearly as impressive as her previous spells, but this one flew fast, landing heavily enough on fake-Carter's chest to cause the chest to cave-in and splinter in a sickening rattle, before outright exploding. \n\nA head and arm seemed to fly off in the aftermath - but silver fire reached from the smoke to reap swallow it in a fiery embrace.\n\nA sigh from Carter followed - breathing came easier now without the burden of an elemental storm pressing against them, however invisible it was. \n\n\"Is there *anything* left to bring home ... The Lady Circley might have wanted proof or a face to follow through for an investigation,\" Carter wondered out loud. Privately, she also wanted to make sure no one could find the remains of fake-Carter or fake-Ilya. Who knows what a underground cult might do with their voodoo magic.","timestamp":"2024-04-10T23:32:47.439000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":53,"userName":"_coiiapse"},{"id":"1228134267650052156","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From the covered casing of the barrels two twin shots raced forward. Each seeking to reach their destination before the other in a playful competition. The ignition of a flame spell lit a tracing tail on the twin shots and their increasing speed grew the trail longer and longer. With shared purpose they switched back and forth twinning around their formed helix of light. But with no clear winner, the 9.3 mm enhanced shots bore into the wooden shade of Carter.\n\nThe frail girls form took into the air with the inertia and the center body inflated into flame. Bladed rings of fire expanded from within and cut her form in two. The finale closed with a great shock of fireworks, and the doll of Carter was severed of its temporal existence.\n\nBut as the pieces of the Sentinel flew across the stage there was a lingering will that would speak once last. \nFoul energies erupted from the puppets shattered form and shockwaves covered across the remaining fifteen members of the crowd. The shadows of this things energy would combine with their will, giving them an age old gift and reverberating one last message…\n\n*“Seek……Aero”*\n\nAbility +\n**Enshrouded:**\n*-- Able to clearly see how mechanics of an Aero user will function without explanation.*\n\nWatching the smoke rise of the ashes, Behemoth turn to acknowledge Carter. \n“The accounts of fourteen others, myself included, and the fact that we are alive will be more than enough proof.”\n\nHe said looking over at its remains. “That unholy thing was not human either, identity is irrelevant. Blowing the shit out of it was the right choice.\"\n\nBehemoth switched his perspective to the remaining members. In the distance Filuent took to heal others that required it. Behemoth spoke while observing. “We will still need to check the status of the camp up ahead. Lets take a second to tend to those who need it and prepare to move out.”","timestamp":"2024-04-12T00:07:07.039000+00:00","edited_timestamp":"2024-04-12T00:09:46.544000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":54,"userName":"kyroscript"},{"id":"1230253823809814599","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"With a bit of magic, Ilya lifted her hat off Carter while Behemoth has her attention. Soon she let out a long sigh of relief as she readjusted her hat back into a comfortable position on the crown of her head.\n\n\"Definitely gonna renegotiate a higher reward for this...\" Ilya mumbled as she slowly turned to look at the survivors of the battle. Looking at their figures, covered in grime and soot, and an unhealthy amount of blood, Ilya began to rummage through her equipment. She pulled out mana potions, healing salves, and even some small snacks, tossing them around to the members.\n\nUncapping a vial of mana potion for herself, she began speaking to Carter and Behemoth. \"I caught a peek further down the tunnels toward where the magic was earlier in the battle. Do— ack! forgot to put some honey in this one... Does the Visudens know about that damn crystal?\"","timestamp":"2024-04-17T20:29:28.607000+00:00","edited_timestamp":"2024-04-17T20:31:35.472000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":55,"userName":"alteras"},{"id":"1232472892634173502","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"“Crystal?” Behemoth hummed in a melody of thought. \n\n“Orcobras in nature I imagine? I can’t say I was briefed about any crystal, although we were told a weapon was housed within these tunnels. The origin of which was from Eldorian in nature. We definitely weren’t expecting waves of magics.”\n\nThe behemoth took a deep breath in. Smells of frozen liquid and burn ground littered the air in an unusual stench.\n\n“There are several things that bother me here. The entire purpose of bringing Guild member along was to prevent Eldor from making drastic movements, but whatever the hell that thing was didn’t seem to care much about political gain. Even if it was created by Eldor, what the hell did it want? And what about its dying words? \n*Seek Aero.* \nI can’t say I have ever heard that name before.”\n\nFrom the crowd Filuent pulled her light of healing for a moment distracted by Behemoths words. While he waited in thought she walked over to speak.\n\n“Aero is part of the Tree of Fate.” She spoke softly. “I can only speak from a religious point of view, but it is considered the force the Tree used to influence people.”\n\nBehemoth looked with a blank expression.\n\n“It’s actually a rather niche part of the text and rather heavily debated. If you like I can explain it in depth.”\n\n“Yeah……I’ll pass. Most of whatever you say would likely just go right over my head.”\n\nTurning away Behemoth looked back out over the remaining group. Many were being filled with vigor once more. \n\nIt was over, no doubt Visuden had been their saviors, and they would rejoin to the camp with praises, he thought. There wasn’t a need to linger too long to lick wounds, the earlier the better in his mind.\n\n“We will get answers once we make it back to the surface of Lithos. Everybody up and moving.” He said turning toward the tunnels that lead to the center. Any extra words could be spoken on the road.","timestamp":"2024-04-23T23:27:15.843000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":56,"userName":"kyroscript"},{"id":"1244786433462501438","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The hypnotic sound of echoing footsteps ran through the tunnel as the group paced forward. All had collectively gathered to make haste, and whomever needed assistance moving was given a partner to walk with. Fifteen souls marched into the abyss with only each other to watch their back.\n\nThe distance formed a veil of shadow, clouding their vision from the central conversion. But as they came close enough to their destination, their inhibitors were lifted. Above the crater floated Ocrobras prime.  Even dormant, the slivers of light split multiple times, crossing in all directions as the shard rotated slowly. From beneath the relic Phoe stepped forward, the others of the first legion accompanying her.\n\n“Behemoth, heroes of the guild, and the remainder of the task force.”  She spoke.\n\n“Phoe. Not that I am ungrateful for the timely intervention, but Circely hadn’t mentioned any intention of your arrive.” As he said this Behemoth looked around. The remaining Eldorian’s laid dead on the ground. Around the Ocobras prime there was a platform of metal and machinery that operated the crystal. On the side of the machinery their were several insignias, one of which was the Selhorn family.\n\nAs it clicked in Behemoths mind what had happened Phoe spoke again. “Behemoth. You and everyone else here are under arrest for the use of forbidden magics. Namely that of Aero.”\n\nFrom the shadows around them more of the first stepped out forming a circle around them. \n\n“What?” Behemoth replied.\n\n“I’ll dispense with the pleasantries. You all played your part nicely, my only regret is that you two lived.”\nPhoe looked in the direction of Ilya and Carter.\n\n“Worry not, your death here will be reported at the hands of Eldor and will spark the guild into motion. With their assistance in the coming war, we will annihilate Eldor.”\n\n“I won’t let you do that.” Behemoth spoke stepping forward. The skin around his body forming a dense armor.\n\n“Oh poor thing. You won’t have a choice. ‘Enhance by Visuden technology’ and you think we didn’t put a safe guard for if you turned against us?” Reaching into her pocket she pulled out a whistle and blew into it. \nThe object itself made seemly no sound, but the effect rippled through Behemoth. Slowly the part of his body began shutting down against his will. Despite his best efforts his mind began fading away. Who were his friends? Why was he here? What were they fighting?\n\nEventually there were no thoughts anymore. \nOn the outside Behemoth would turn to the group silently.\n\n“Kill them.” She said.\n\nWithout hesitation Behemoth leaped forward smashing the ground. The shockwaves lifted dust into the air and knocked the heroes off their feet. Many of the first jumped into the smoke to engage.\n\nPhoe looked to the Ishile, the leader of the first legion. “Start charging the crystal. If they aren’t dead by the time its charged, scourge the land until their dead.”\n\nIshile nodded, and waves of energy formed into the crystal. With that Phoe disappeared into the shadows leaving the heroes to their fate.","timestamp":"2024-05-27T22:56:52.751000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":57,"userName":"kyroscript"},{"id":"1246692951627796590","channel_id":"1167917480249929819","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"At the clear words of betrayal, Ilya attempted to bring forth her barrier yet again. Unfortunately, be it due to exhaustion from the prior battles or just the momentary confusion over the actions of their huge friend, she was not fast enough and was launched onto her back.\n\n\"Agh!! Shit!!\" Scrambling to refocus herself, she tossed across the ground just as a soldier of the first legion slashed at where she just was. Continuing to dodge left and right, Ilya's hands started to turn less erratic and more focused, as she swing her hands in an exaggerated motion.\n\n\"Gales of the Traveler!!\" An immense wind blew across the cavern, pushing the smoke away - and the soldier attacking her along with it.\n\n\"Everyone!! I have command!! Carter!! Stop the charging!!\" Ilya yelled before reapplying the enhancements she thought she wouldn't need again today onto the group.","timestamp":"2024-06-02T05:12:42.103000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"✨"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":58,"userName":"alteras"},{"id":"1253082516093403156","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"https://www.youtube.com/watch?v=xx10iSmVMo0","timestamp":"2024-06-19T20:22:32.984000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[{"type":"video","url":"https://www.youtube.com/watch?v=xx10iSmVMo0","title":"月下彼岸花 ～蛮神ツクヨミ討滅戦～","description":"Provided to YouTube by NexTone Inc.\n\n月下彼岸花 ～蛮神ツクヨミ討滅戦～ · Masayoshi Soken · 石川 夏子 · Michael-Christopher Koji Fox · Masayoshi Soken · Masayoshi Soken\n\nSTORMBLOOD: FINAL FANTASY XIV Original Soundtrack\n\nReleased on: 2018-07-04\n\nAuto-generated by YouTube.","color":16711680,"author":{"name":"祖堅 正慶 - Topic","url":"https://www.youtube.com/channel/UCjosnnCN5F5SO1tpOCDExAQ"},"provider":{"name":"YouTube","url":"https://www.youtube.com"},"thumbnail":{"url":"https://i.ytimg.com/vi/xx10iSmVMo0/maxresdefault.jpg","proxy_url":"https://images-ext-1.discordapp.net/external/LYbieXj8zKpp-7fECLJlaGSz63bJcLtjG2L9GENCHZc/https/i.ytimg.com/vi/xx10iSmVMo0/maxresdefault.jpg","width":1280,"height":720,"placeholder":"hlgGFIjY9zd5hniJdnf4e4m/lw==","placeholder_version":1},"video":{"url":"https://www.youtube.com/embed/xx10iSmVMo0","width":720,"height":720,"placeholder":"hlgGFIjY9zd5hniJdnf4e4m/lw==","placeholder_version":1},"content_scan_version":1}],"pinned":false,"type":0,"flags":0,"components":[],"position":59,"userName":"kyroscript"},{"id":"1253082521206521869","channel_id":"1167917480249929819","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"In natural circumstances the sun heats the planet’s surface unevenly, this dissonance creates areas of high and low pressure. Air always moves from locations of high pressure to those of low pressure, creating wind. \n\nSo, what happens when someone uses magic to create wind? Does the soul move each molecule by itself, or perhaps it alters the pressure to create wind? Scholars of Albion have long since asked this question. What is magic and how does it function? \n\nWhile many theories as to the reasoning would surface, one particularly interesting theory has stayed afloat. All things within the universe down to their most fundamental level are made of the same base element. We call this element…Mana. Our “Souls” are theorized to be made of something different than mana, something able to influence it.\n\nAs such, spells are the soul’s way of understanding how to alter the world. In this theory, humans did not discover the complex verbiage and symbols used to cast spells, but rather *created* them as a universal way that people can understand how to influence the world around them with their souls.\n\nBy this logic, all magic is a form of creation or creativity magic and is inherently built from the same roots. Our “specializations” are only a figment of our own design. Anyone and everyone is capable of wielding great power or none at all, depending on themselves.\n\nWhile this theory has largely been criticized, it has never completely left the academic world.\n\nWhatever the true reason, when Ilya snapped her finger air would erupt forth pushing back the shadows of dust. While this pushed many of the soldiers, the difference in bodies was far too weighted toward Visuden. \n\nLeaping from the lifted shadows, Behemoth dashed forward toward Ilya and reached out to catch her throat. The fatigue too great on her form, her dodge failed, and his armored body took hold of her. Behemoth lifted her into the air and the waning oxygen muffled her vision as the sands of life slowly flowed to the bottom of the hourglass.\n\nFiluent prepared to fire against Behemoth but stopped herself. Any attack powerful enough to breach his dense hardened form would risk hurting Ilya. That moment of hesitation would lead to her and several others folly. One of the stray shots from the First Legion lend itself through her body.\n\nFrom her enclosed prison Ilya would see Filuent fall. The disarray would catch more than just Filuent, as the crushing silence sought Ilya, she would watch the echoed shots bring Octavia, Cohn and three others to the ground.\nAs the last of the sand fell through the center of the glass, Ilyas vision would fade away. Only these final words would reach her.\n\n“Perish.” Spoke the cracked voice of a woman.\n\nThe sound of a point blank revolver shot woke Ilya from her slumber as Behemoth *let go of her*.\n\nFrom around the arena several of the Eldorian corpses rose up and began opening fire on the Visuden soldiers. Chaos took over the battlefield as panic ensued in the First Legion. A suicidal explosion erupted from the crystals control panel and Ilya could see as the Orcobras Prime began changing color from its fire element to water instead.\n\nOne of the Eldorian corpses had changed the element and destroyed the control system at the same time. The First Legion would be unable to swap the element or stop it from creating water.\n\nWhen the curtain of Behemoth’s body fell, Ilya would see flowing blue hair, sparking crystal eyes and the body of a corpse made puppet. \n\nSimra.\n\n“His skin forms gaps that are weaker than the rest, hit those. It will only render him down for a short time.”\n\nSimra spoke softly, and quickly. The action itself was challenging for her to maintain. “Escape. This place drains water, when the crystal goes off, follow the current outside the city limits.” She pointed to Filuent, and the others that had fallen. “They are still alive.”\n\nSimra's shades would not hold the Eldorians for long. Whatever needed to be done, must be quick.","timestamp":"2024-06-19T20:22:34.203000+00:00","edited_timestamp":"2024-06-19T20:23:36.955000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"689310029458702431","name":"HAMSHOCK"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":60,"userName":"kyroscript"}]