[{"id":"1164120785884033084","channel_id":"1163197885245038652","author":{"id":"179260464956440576","username":"gabbie0w0","avatar":"733fb651107eec3a4a024a017c0d3186","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Gabbie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"August Albinchyr, King of Albion, scowled, as dark red portals began appearing all over Albion, pouring out hellish abominations, demons and devils upon his lands. August's everpresent eye and ear was cast across Albion, trying to gather as much information as possible about this invasion. His glance turned towards an attendant standing next to his throne, whom immediately bowed his head in respect. \n\nAugust gave him a gentle smile, and said, \"Get me the Marshal, if you'd be so kind.\"\n\n\"Yes, your Majesty,\" he replied, running off outside of the throne room.\n\nAfter a couple of seconds, Cassius came into the room. He placed a hand upon his chest in salute. \"Father.\"\n\n\"There is no time for pleasantries, son,\" August spoke sternly, but without an afflection of a smile donning his features. \"The brunt of the attack is focused on Williamstown. Take a regiment and a squad out of the Bells and go assist the Guild, I'll contact Hastur, and make sure he's forewarned.\"\n\n\"Yes, father,\" Cassius said, bowing his head slightly and then leaving, beginning to bark out commands the moment he was out of the throne room.\n\nAnd with that, he took out his Guild Seal and activated it with a channeling of a few strands of mana, hoping to get Hastur's attention.\n\n_My daughter's there. Gods be with her._","timestamp":"2023-10-18T08:40:23.673000+00:00","edited_timestamp":"2023-10-18T08:40:59.687000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"955789183924977684","name":"Clap","animated":true},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"userName":"gabbie0w0"},{"id":"1169107547899318293","channel_id":"1163197885245038652","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Aftermath: A M̴͍̌iracle in a Small Village","timestamp":"2023-11-01T02:56:00.387000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1169107547899318293","guild_id":"796570401681309696"},"flags":32,"thread":{"id":"1169107547899318293","type":11,"last_message_id":"1237263878635913216","flags":0,"guild_id":"796570401681309696","name":"Aftermath: A M̴͍̌iracle in a Small Village","parent_id":"1163197885245038652","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"212762756271570945","thread_metadata":{"archived":true,"archive_timestamp":"2024-06-06T04:51:19.266000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2023-11-01T02:56:00.387000+00:00"},"message_count":23,"member_count":3,"total_message_sent":23,"member_ids_preview":["214058147499868160","198327629047267328","212762756271570945"]},"components":[],"position":0,"userName":"hanarei"},{"id":"1169107549602205717","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The lingering chaos of the demonic invasion had seemed to finally settle down in the small village along the outskirts of Albion. While the brunt of the attack had been focused towards Williamstown, many other portals had popped out scattered outside of it. Soldiers and guards were quick to act in order to protect the people. Yet there were some places more scattered across the region that weren't quite as lucky.\n\nIt was one such town nestled along the wilderness that had found it's unfortune luck having drawn a small portal from which several demons had wormed thier way into the town. They had managed to cause some havoc forcing the few protectors to action along with it's own small militia of able bodied citizens. In the end they managed to triumph though not without many injured and several casualties from the sudden attack.\n\nIt had been shortly after the situation had been difused with the three cloaked figures had arrived. Appearing rather humble in appearanmce the three had approached the town seeking to provide aid. A gesture that given the dire state many of the citizens were in it was something they could use any help they could.\n\n**\"Relax... simply ease your mind. As followers of Adix we are able to help heal your wounds. Simply clear your mind and accept such a gift...\"** The sultry voice escaped from the hooded figure. Her gentle blue eyes lingered out from the cloak appearing so pure yet strangly a little haunting. Only a small portion of her dark hair peeked out from it as she rested her hand upon the gravely wounded peasant who had taken up arms despite his inexperience.","timestamp":"2023-11-01T02:56:00.793000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"hanarei"},{"id":"1169107798571896883","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**\"To put oneself in danger for the sake of others... such a brave and selfish act is one that surely Adix would look favorably upon.\"** Her words reached the man seeming to hold respect for him as a strange purple glow formed form her hand. The blooded man gasped out as his wounds seemed to strangely heal as if being stitched together. His collapsed long once more restoring as his pale expression seemed to liven back up much to the shock of the few people gathered around her.\n\n**\"...and a chance for such a noble soul to live on rather then fall to such evil.\"** She spoke with a faint smile on her face as the man seemed a bit shocked clutching at himself breathing heavily able to once more do so without struggling. The man gasping out as the few gathered around gasped and were quick to give praise to the woman a she smiled warmly.\n\n\"You... thank you... I... I thought I was... done for...\" The man spoke his words spaced out clearly recovering from having had trouble breatrhing. He slowly stumbled up feeling as if he wasn't hurt to start with. His eyes glancing forward blinking as he glanced back as he seemed a little taken back swearing he heard a whisper though shaking it off. \n\n\"Thank you miss...\" \n\n**\"No need to thank me... the Followers of Adix only seek to provide help to those who need it.\"** She spoke with a smile. Her blue eyes lingering on the man as he seemed to stare back almost in a brief daze before nodding a bit. The cloaked woman glancing over to see her other two followers working to heal others up who had less serious injuries as she glanced back over.\n\n**\"Anyone else require aid? All you need to to ask and I shall provide my support.\"** She spoem her voice gentle and sweet. Her hands stretched as if to offer her hand to move onto treating the next person. They were there to help after all and such a small obscure village was a ripe place to spread such 'influence'.","timestamp":"2023-11-01T02:57:00.152000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"805013142417571841","name":"sus"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":true,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"hanarei"},{"id":"1169107807317012540","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"They only sought to help those in need... to give those a 'gift' that was sure to lead them to true salvation... not just now but into the future.","timestamp":"2023-11-01T02:57:02.237000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"844284192590135376","name":"blobcatgooglythumbsup"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🪄"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0},{"emoji":{"id":null,"name":"🫗"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"hanarei"},{"id":"1175620699038158988","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The white light of stars struggled to illuminate the village on the outskirts of Albion. Many of the fallen leaves and barren trees signaled the continual cold which plagued this land. From the distance fog creeped into the village town. Covering every corner, seeping into the dirt and very walls of the stone shelters its inhabitants held so dear.\n\nFrom the wake of the damage the invasion caused these followers of Adix sought to heal the wounds of the citizens and gain their trust. Meanwhile, a shadow of flight landed on the rooftops of one of the houses, gliding from top to top.\n\nAmong the crowd many applauded the efforts of the wolfs dress as sheep, and the women healed them one by one, as time passed the circle of bodies grew ever larger to witness such miracles.\n\n“Now now, pray tell of yourselves, oh followers of Adix.”\n\nThe cluster of bystanders split nearly in half to make way for a presence of a man covered in rugged cloth. Stepping forward James took to the opposition of the women. He surveyed many of the townsfolk and saw their reactions. No doubt they held a bit of fear, but it was growing smaller by the moments, he had but one shot at swaying the people to his side, and he was doubtless starting at a disadvantage. Still, it was certainly worth a try.\n\n“I have traveled to these hellish lands more times than years you were born, and I haven’t heard the name Adix once. Care to share the truth your intentions, oh noble bringers of aid?\"","timestamp":"2023-11-19T02:16:56.627000+00:00","edited_timestamp":"2023-11-19T02:27:14.789000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":"955405902901571584","name":"meowPray"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"kyroscript"},{"id":"1176727017492860989","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The woman's head shifted as she slowly stood up. The new presence seeming to shift her away from her duties as she stood up straight. Her very presence had seemed to bring the people together to witness her miracles. \n\n\"Truth, or is it you seek some form of fiction? The way once such as yourself carries your presence shows that of malice, yet I am almost certain your own intentions themselves are not thus.\"\n\nHer voice spoke rather swiftly as if to turn his words upon him. At first as if to imply ill will tough strangely shifting her words as if to show a sense of his own benevolant purpose despite his rather foreboding appearance. \n\n\"Adix is one of whom wandered the lands to aid those who were in need, and whose very existence had nought but the faintest whisper in the history books. One whose virtues of helping others was of sheer benevolence rather that of self-aggrandizement.\"\n\nShe paused lifting her head as her blue eyes faintly could be seen under the cloak. Glancing at the man with a warm smile lightly coating her lips.\n\n\"The Followers of Adix follow not a god nor a man but the principals of which such an individual brought to this word. An idea... a belief of which those in need and those who should want might be picked up and raised up from the abyss. To  carry on that will.\"\n\nShe lifted her hand up showing her empty palms as to gesture in a way as if to emphasize exuberance. \n\n\"We aren't those seeking reverence, only to help. Our name is but whispers because we do not linger but travel to provide our aid to those who need it and would accept of it. As Adix had done before we continue on willing to wander the world quietly providing help without any need or desire to have our name glorified or those who receive help from us to feel obligated to give anything in return but to ideally carry on the desire to selflessly help those in need that they might be capable of helping.\"\n\nHer hands lowered to her sides glancing at the man from under her cloak.","timestamp":"2023-11-22T03:33:03.501000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":4,"userName":"hanarei"},{"id":"1178383572458025040","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"A small humming rose in pitch in the back of James mind as the situation escalated. The blowing winds fanning the nearby wind chimes only sought fuel his imagery stress. Near the back of the village ICorus slowly positioned herself and likewise Zi slithered his way through the crowd. \n\nMany of the villages whispered mumblings of distrust toward James. Unsurprising as it was, he still disliked it. James had assumed the conversation was doomed from the start it, but any further pestering would likely simply result in the women continuing to dodge questions. Perhaps a different approach could still provide more time.\n\n“Forgive me for my aggressive nature. I am a simple wanderer and had heard whispering of a dangerous cult, you can imagine I wanted to make sure these peoples lives were in good care.”\n\nHe said to take a step forward. Flames of even distant lanterns were covered in mist as it thickened around the town.\n“And I can assume you are the leader of these followers of Adix?”\n\nWhen given this assignment the Pathfinders had given them next to nothing when it came to information. In her own words, their name is but whispers. What magics they call upon, whom they may hold allegiance to, and what they intend to do are all still mysteries. Perhaps he could glean information on at least one of those.\n\n“Of course, if your cause is such righteous as you claim, you won’t mind if I question some of your patients, would you?” He said pointing to the man whom she just recently healed. “How about you? Having recently been saved from the jaws of death, how do you feel?”","timestamp":"2023-11-26T17:15:36.982000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":5,"userName":"kyroscript"},{"id":"1180026526629122080","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"\"Leader? I suppose if one wanted to consider some sort of hierarchy then I do happen to hold a position of higher reverence within the group... although calling it a group is perhaps not the right term to use as much as being wanders who tend to go about our own business spreading Adix's good will by proviidng help to those in need. My reverence comes mostly due to my seniority more then anything else.\"\n\nShe spoke quite plainly. A truth as much as one of an otherworldly nature might prescribe. After all the Follows of Adix very much were an entity of their own even if they did fall under the scope of the cult. Not everyone who might take up such a mantle would necessarily be fully entangled within her group.\n\n\"Question them as you like. We do not plan to linger here long, I would ask given the recent attack you would be kind and considerate to their recent plight. We are only able to provide them healing, we lack such resources to completely undo the attack that had befallen this small village.\"\n\nZaria bowed her head with a warm smile on her lips. Her arm lifted up in gesture providing only the simplest of requests. After all, she knew full well he wouldn't find anything. \n\nThe man seemed to look on almost a little bit lost shaking his head. Given how close he was to death not perhaps an unexpected response given how he went from dying to being almost perfectly healthy.\n\n\"Ah... I'm... alright... I feel a bit strange nearly dying... but I feel rather incredible. It feels as if I had just woken up refreshed like I hadn't even fought a demon in the first place.\" She spoke nodding his head. Such little whispers that had crept in the back of his head having faded away simply dismissed by him at this point.\"","timestamp":"2023-12-01T06:04:07.781000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":6,"userName":"hanarei"},{"id":"1180978918082232360","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"As he listened, in the back of James mind he began forming a largely flawed hypothesis of his enemy. Despite her having actively spoken that she was in a position of power, groups like this often had many subordinates that would partake in the illusion of leadership while the true powers sat behind the scenes. To him, this woman was simply a speaker for others that wouldn’t have the courage to step out and do the dirty work of recruitment, and since she was only a healer, there was little concern of her strength.\n\nIn traditional sense, James should thank the women for her time, then turn around and walk away. This would fall in line with the guild preferred actions of morality to not endanger other unrelated lives. They could observe the members from afar and gain information toward their intentions, since there was always a chance they were not malicious.\nAnd his fallen efforts to converse had spoken to the validity of this decision.  The slowly shifting weight of the situation had only sought to push Zaria’s advantage further. Members of the audience spoke up against his presence, “I feel you have questioned her enough.”\n\nEchoing voices joined the conversation, “The boy is healed, no? All is well, what is the point of this questioning?” \nHe bowed to the women in a respectful manner and turned away. “Thank you for your time.” As his foot hit the ground toward the of opposite direction, the echoes of a .45 caliber enhanced shot rippled from the hands of James unto its intended destination, a none lethal location along Zaria’s body. \n\nJames fired several more rounds towards the members of Adix standing next to Zaria, aiming to kill. Raging fear crossed the village as people took shelter from the now ensuing chaos. As the crowd disappeared the swordsman Zi was revealed behind the Adix members. He stepped forward attempting to slash down any members he could. \n\nIn a circle around the conflict formed flames of fire sustained on ICorus magics. James assumed she likely created it with the intent of deterring innocents from getting involved, and to keep the Adix members with the fight.\n“Now, followers of Adix. In the name of the Guild of Heroes, you are under arrest.”","timestamp":"2023-12-03T21:08:35.598000+00:00","edited_timestamp":"2023-12-04T01:02:23.891000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":7,"userName":"kyroscript"},{"id":"1183909455897829487","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The gun shot hit true striking at Zaria as she went falling forward. Her body remaining on the ground. The shots firing off were followed as another approached slicing at the members who had accompanied Zaria. The men had gasped out struck down falling down to the ground much like Zaria though seeming far more harmed as pools of blood leaked out pooling beneath their bodies.\n\nThe woman heard the utterance of them being under arrest. A soft sigh escaping her lips. The guild huh? She pondered the idea a little though didn't say anything more. She wasn't ready to reveal her hand after all. She couldn't tell just how much Hastur might know after all. She wasn't quite ready to address him. \n\nA purple glow lingered as chains erupted from the ground as a circle engulfed her fellow followers. Their bodies were drug down seeming to meld into the earth dissipating from sight. She didn't wish for them to be involved... knowing that such followers despite the far more fatal wounds wouldn't of been taken out so easily. \n\nThe result however wouldn't be... beneficial in their resurrection with her unable to likely heal them up given the pressure she had seemingly been placed in. \n\nZaria slowly began to stand up. The hole of which she had been shot seeming to show traces of blood lightly blotched as she seemed to otherwise shake off the effect of the wound. Her eyes glancing out from the cloak looking at James and taking note of Zi.\n\n\"Is this what the guild is doing now a day? Attacking those providing help to others... placing civilians at risk? I am... quite disappointed.\"\n\nThe woman spoke shaking her head a little bit looking forward as she seemed otherwise rather calm. She lifted her hand up as a faint glow lingered as she touched where she was wounded as if to heal it up. More so a formality then something she needed to do.","timestamp":"2023-12-11T23:13:30.260000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":8,"userName":"hanarei"},{"id":"1183911660096856214","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"\"I have no intention of being put under arrest when there are those who are in need to serve. A task that perhaps if the guild had done it's part such a task wouldn't be required of us... but alas we still wish to aid those in need.\" \n\nShe spoke seeming unflinching in what she wanted to say. Words that for her were spoken in truth though given her own view and scale of such 'beings' it was only natural to have its own motiviation or view of what such a thing actually involved. \n\n\"Now... I simply wish to be on my way... I have my fellow followers to go to treat after you have expressed such hostility... though if you wish to get in my way... or seek to put the innocent in harms way...\" \n\nShe spoke pausing as she glanced back as if to look in the direction of those she had 'helped' as if to make a point of it. Her eyes glancing back at James.\n\n\"I will fight if I must... though I much prefer not to do so. It is a waste of time and energy that could be best placed in the service of others.\"","timestamp":"2023-12-11T23:22:15.782000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":9,"userName":"hanarei"},{"id":"1186176207587381268","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"“In the service of others?” James said, shaking his head. Curling vines of fire laid the background for Zaria's imagery of him. The shadows from the backlight covering his brown clothing wrapped around to lay over his face. \n\n“We live in a world of magic beings more powerful than anything that could be imagined, catalysts of world ending design which hover on the horizon by our own doing, and all while the countries of this world think only of themselves.” \n\nJames raised both of his hands and looked around, bringing attention to the invasion which had just taken place. During the action he subtly grabbed an image of ICorus in the distance. He was unable to communicate with her, a large oversight in his plan. She would be unable to warn them of major changes in mana, and likewise could not hear what he was saying to Zaria.\n\n“What is a man to do in this world but seek to actions which benefit him and him alone. How else can we survive other than to horde our resources and hide underneath a rock hoping for the best?”\n\nJames took steps forward toward her. “Do you consider yourself a gambling woman?”\n\nAround Zaria symbols of magic formed orchestrated by ICorus, and ice shards lifted to trap the woman in a binding of ice.\n\n“Let’s have a bet. I bet you are here for malicious intent, like everyone else who offers aid for no return, and whatever immoral things I do here will be forgiven once I take you back to the guild and you confess, even if that confession is forged.” \n\nFrom behind, Zi stepped forward preparing to apprehend Zaria, they would attempt to take her back to the guild if she did not interfere.\n\nJames pressed his weapon to her forehead. “And what do you bet.”","timestamp":"2023-12-18T05:20:45.977000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":10,"userName":"kyroscript"},{"id":"1191968359022067765","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Zaria looked on as he spoke clearly commenting of the disasters and threats that laid out there. An almost nihilistic view of the world to some extent. A truly sad state of affairs as she viewed it. Such a mindset was only destined to bring one to failure. To simple accept such things as inevitable rather then seek to prevent it. \n\nNo, she very much would ensure mankind would thrive. *He* might of sought to rid of such mortals but it was *their* intent all along to give mankind something more. To bless mankind with a gift that could allow such inevitable cataclysms to fall and give mankind a chance to live on when such things sought to put the world in ruin whether of ill intent or simply of happenstance. \n\nNo, such selfishness to survive was not the way. Unification... not so much under a single cause though out of a single desire to grow. Yes, *she* would help them thrive. To give them a gift that holds perhaps its own danger but she was confident they could handle and as such survive onward as a stronger mortal people. How their first attempt might of been misguided even she could admit... but she had learned. \n\nIt was about seeding such things slowly... allowing it to fester and grow until they gained the strength to handle it and from it she would grow empowered. As she would grant them strength she in return grow in her own. Both prospering in the act. It wasn't of her own desire for power even if it so benefited her. No, it would allow for such mortals to prosper under her graces and by such she felt no better joy. An act she saw as selfless offering freedom to live on. Even if they didn't seek to worship her she was content with what she could give them. \n\n\"Selfishness... a foolish thing... unity together is what allows for even the weak to survive.\"","timestamp":"2024-01-03T04:56:42.492000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":11,"userName":"hanarei"},{"id":"1191968498528833647","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"She glanced about as ice shards lifted up as the binding of ice surrounded her. The woman looking on quietly staring on rather relaxed from under her hood. They seemed overly confident desiring to capture her. His emphasis on taking her back to the guild noted. A rather sad thing to hear. \n\n\"My intentions I have made clear... though it seems your insistance on bringing me in really hampers my own goals. Such a thing I am unprepared for. Your Guildmaster isn't one who we are not ready to communicate with. A figure of his... origins... isn't exactly the most welcoming. I fear without proper progress and work done he wouldn't even be willing to entertain our great work.\"\n\nShe spoke giving a sigh shaking her head. Her body quite relaxed as his weapon placed directly on her forehead. Her eyes glancing at him rather fearless despite the threat he impossed on her.\n\n\"A shame... if on more mutual terms I feel we could of gotten along. No matter. You won't get any gambling from me today... as much as I'd say it is less of a gamble then that of false imprisonment that benefits no one for such a task. Alas... you have chosen violence and to seek to limit our efforts of aid.\"\n\nZaria spoke as her voice came out almost a bit haunting. A strange unease filling the air as she stared at him. Her blue eyes glancing at him almost mesmerizing a she looked to him directly despite the direct treat pointing at her head.\n\n\"So then... will you attack me... or shall we finally depart? As I said earlier... I would appreciate getting to my poor companions of whom you barbarically struck down in an act of pure evil. If I was a typically priest such an act would not be afforded to one sinful as yourselves... but alas as much as a grieve for such acts... nor even the wanderer himself.\"","timestamp":"2024-01-03T04:57:15.753000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":12,"userName":"hanarei"},{"id":"1194454213414105299","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"James listened to Zaria speak. To a time long passed her actions might have seemed inspiring. In his life there was a time where such ideas he sought to bring to the world. Unification, a solution to the clouting mana that suffocates the world.\n\nFor many of people of this world, they knew of the encroaching glass ocean and its cause by there own hand. Before many of his adventuring days he sought to challenge the world, to force change upon a failing system. But like an animal his failures beat him into submission, over and over until he was no better than those he sought to change. \n\nNo man can change the world, for the world is greater than any single man. Those were the ideas that finally solidified the water of his soul.\nPulling away his gun, James set down his guild seal on the ground. Behind Zaria, Zi followed the same motions. A fever of sickness spun around them as the charms reacted to their call. Spiral purple energy curled upward.\n\n“This conversation is pointless. I don’t need to attack you if you don't have the strength to resist. I promised to bring you back alive anyway” He said disapproving of his wasted time. Wholly unaware of her strength or the situation he had led the three of his comrades into. As the charge of mana hovered his hair into the air to float aimlessly, he spoke.\n\n“Long has the guild needed to subdue foes from afar. The long-standing answer to the question, ‘How to we take our foe back from the deepest darkness dungeon’ was answered by this.\"\n\nTeleportation. \nIf Zaria did not want to be transported thousands of miles by distance to the deepest part of Fort Greys prison cells, she would need to act.","timestamp":"2024-01-10T01:34:36.364000+00:00","edited_timestamp":"2024-01-10T03:44:37.411000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":13,"userName":"kyroscript"},{"id":"1198171741751607356","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Zaria softly let out a sigh shaking her head. Her eyes drawing back up aaware of what they were attempting. Her hands shifted gesturing into the air as a purple haze lingered in the air. As the teleporting magic began to take shape something strange occurred. The magic errupted as it teleported the three of them. However, it wasn't the dungeon of Fort Grey they found themselves at.\n\nAs the magic fizzled out the three of them stood now in what appeared to be the clearing of a forest. The trees themselves lumbered rather high in the air the woods themselves appearing to be a short distance away. Not far from her own companions though she had been careful as to not disrupt the spell to bring them exactly where they would be waiting for her.\n\n\"Very well... if you insist on forcing my hand...\" She spoke as she glanced out from the cloak. Her hand tugged at the hood as she let it slip out pulling out her long black locks. The white strand visible as she looked forward. \n\nHer lips parted to speak, the words themselves however almost coming off inaudible as a strange golden chain errupted from the ground in front of her. It lifted into the air crashing into the ground before splitting apart acting like metalic vines crawling along the ground attempting to ensnare anything in their path aimed towards James as more shot backwards errupting out like a net meant to take hold of Zi like a chain linked net.\n\nHer hand lifted up as if already prepared for some form of retaliation as a purple glow lingered around her creating a barrier of which to catch any attacks directed at her.","timestamp":"2024-01-20T07:46:44.188000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":14,"userName":"hanarei"},{"id":"1201752669711237161","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From the villages distant tower ICorus’s hair stood up as she watched the enemy spin the threads of mana anew. As simple as one would breathe Zaria switched the currents of another’s fabric into a creation of her design. From space, the lines tore a connector between two points and ran a line to a different, unknown location that thread pulling together. \n\nDuring the waning seconds ICorus had to warn James, she lifted her wings. Pressing against the cracking wood she dashed toward them to give some form of warning, but it was too late. As her body crossed halfway point between their distance the rift opened to pull the three of them in. \n\nJames would catch the smallest glimpse of ICorus’s motions before the teleportation. The ripples of the rift stretched across the landscape changing the scenery. When the spell had finished, they laid within the shrouded forest some distance away. \n\nShadows clotted his vision, blood running. Within his mind a voice screamed to run. Fear, genuine mind-numbing fear consumed him. \n\nThough he was not versed well in complex magics, the alteration of another's a spell designed to open a rift between two locations was far beyond his understanding, and she did it with the flick of a wrist. \n\nBut before he would have his chance to futher ponder, the mineral connection within the ground cracked open to pull out an eruption of gold links. Smashing to the ground around him and rupturing outward to chain him down. Likewise, Zi fell to a similar fate of the opposite location. \n\nJames let out several volleys of shots toward Zaria while dashing away. As the enhanced metal structures of the bullet make contact with the barrier, every molecule down to a singular level split seamlessly. This action happened with extreme precision, removing each component of the shot from existence with intention to prevent explosion. First disintegrating the incendiary round before removing the outer penetrating shell and then the activation components.\n\nThis was repeated flawlessly with each shot he took.\n\n“Zi! Buy some time!”\n\nAs James said this, Zi casts spells with intent to obscure. Illusion magic filled the area and copied the images of both. After several second multiples of James and Zi filled the area dashing around each with a mind of their own. \n\nThis action would take appearance of a maneuver to retreat in desperation.\n\nIn truth, however, both James and Zi were hiding within the shadows attempting to build enough mana into a single attack that would have any effect on Zaria.","timestamp":"2024-01-30T04:56:03.944000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":15,"userName":"kyroscript"},{"id":"1206415166426845255","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Zaria glanced over her hand lifted posturing as she watched the two evade her chains. Not an unexpected outcome though one that was none the less a mild nucance. It would of saved her a lot of time to ensnare the two.  Her eyes glancing rather coldly using her magic to block Jame's shots with ease. \n\nHer eyes lingered over noticing as the magic the one named Zi was performing. Illusion magic as she could tell. Her eyes lingering about as the images of the two only become more and more numbered as it was a clear tactic used to obscure themselves. To perhaps make an escape?\n\nNo, she was certain if they were so bold to act aggressively, running away wouldn't be an option they so take to, not unless they felt it was their only option. The Guild of Heroes never tended to be a group to back off from danger. While it seemed their current state of being was a hollow shell of it's former self, she had a feeling they were still bold enough to not simply flee at the first sign of danger.\n\n\"To try such trickery on a priestess... has the guild lost all sense honor they had once been known for?\" She spoke closing her eyes as she seemed to pause in place focusing her senses.  Her eyes cracked back open locking directly where they now hid clearly seeming to be preparing to attack her. A black and purple swirl of cloud swiftly forming over them as her hand lifted up.\n\nDivine Judgement...\n\nFrom the cloud a sharp eerie white bolt of lightning thundered out striking the area around them. The attack itself quick to strike and surge out from the ground sending crackling energy to zap anything within a decently large area. Even after striking the bolts would linger surges of them expanding out from the center point sending sparks across the ground as the very air seemed to sizzle in response. The very air itself managing to hold a strange otherworldly charge to it.","timestamp":"2024-02-12T01:43:09.786000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":16,"userName":"hanarei"},{"id":"1212269434325045248","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"From the curling fire, ICorus sat down at the vacant space where the fabrics had closed the rift. She would need to find them quickly. The frigid fog still covered the land and as she looked up above her it obscured her satisfaction of a starry night sky. \n\nHer eyes began to sulk into a moment of fabricated despair. She didn’t want to find them. That thing possessed power far beyond what the three of them could handle and she was more aware of it than the others. \n\nWith good reason, she could simply flee to the guild and provide them with a report. The lives of Zi and James were not her responsibility nor was the situation they were in.\n\nBut something coiled within her morality. Her mind wandered to the burning village of Atheey and its now deceased people.\n\nLeading into the lifted water she could see the mana threads tied to their location. In the mist of the humming of embers still lit, she would be forced to make a decision. \n\nSmoke exploded from the false packing of the illusion dummies as they disappeared. Zi could no longer hold concentration on them as the violent electrical energy struggled for control of him. \n\nIn the wake of Zaria’s hard-hitting attack, neither Zi nor James had intended for Zaria to pick their location so quickly. Surging energies from below nearly incinerated their corporeal forms, but Zi had barely diverted their building mana into some form of a shield.\n\nJames quickly took the signal to divert and was able to escape the lingering desolation, and by consequence the fearful rage Zi now inhaled continuously.\n\nThough Zi would not perish, he was essentially immobile until the end of the linger effects, struggling to hold control over the influence of the electron’s intrusion shocking his neuromuscular system without remorse.\n\nAny attempt James would make toward the destruction of Zaria’s form was largely pointless. He instead opted to try and slow her down. He unloaded shots all around into the air. \n\nThese tracer lines followed the ammo into the dirt boring deep into the earth all around. Each one waited silently, were Zaria to get close they would explode dealing little to no damage at all, but slowing the form considerably.","timestamp":"2024-02-28T05:25:56.020000+00:00","edited_timestamp":"2024-02-28T05:28:24.527000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":17,"userName":"kyroscript"},{"id":"1234715442455515158","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Zaria slowly relaxed as her attack. Even as the main thrust of the attack seemed to pass, the sizzling lingered in the air leaving that strange foreboding air. The woman slowly standing straight up looking rather calm and collective. Her eyes sharply falling towards the group having seen they had managed to avoid the brunt of the attack, although not completely unscathed. Her expression didn't linger to show that vague air of gentleness, but a rather stern look of distaste. \n\n\"Mankind... so entrenched in their foolishness. So blind they would see salvation and yet openly walk into death's sweet embrace. To think you would sway to their side and rather then teach them enlightenment and a chance to thrive you allow them to blindly crawl to their own demise. If only you could understand what horrors you lead them to I am certain we could bring them to such glorious new heights!\" \n\nShe spoke seemingly not aimed towards them but as if to herself. Words shared talking with herself. Her hands lifted as her head was turned up as if looking above past them. She knew her words would be met with deaf ears, something she very much in many regards was content and better off with. A simple 'priestess' simply stating her frustrations out load to herself as she slowly approached.\n\nWith each step the flow flickered as the bullets fired. Each explosion seemed to ripple up though stop, contained in their place as the barrier rippled up clearly keeping her safe as even the ground that slipped through the barrier were procted, walking past only to fall into back into place leaving a divot in the ground. Such attacks weren't much a threat that she had to worry about, at least given she could hold the most basic of concentration on it as she approached. She stopped herself just over twenty feet away. Her head turned glancing back at the group looking to them once more.","timestamp":"2024-04-30T03:58:21.385000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":18,"userName":"hanarei"},{"id":"1234715449925570590","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"\"I do not wish for your death... yet... it seems you desire to give me no other choice...\" Her words slipped free as she lifted her hand up slowly holding it up in front of her. A faint purple glow lingered as she looked at them pondering a bit as she seemed to almost be thinking. A certain air of menace mixing in with the already electrified air radiating from her hand. \n\nTerror... emptiness... lonliness... despair. It was like looking into a black Abyss as it radiated in front of her in a sphere before suddenly changing shape. What was one orb turned into several snake like sections spiraling around. The dark mass tinting purple as it seemed to twist and shape thinning out as she slowly turned her hand as if an outstretched palm the shapes only become more snake like as they spun around twisting loosely around each other.\n\n\"Yes... perhaps... perhaps the only true answer... is to give you a taste of that darkness your foolishness will lead you. The horror that should haunt you. The fear that will keep you awake. The shivers and existencial dread that blinds you of what your ignorance will lead you.\" \n\nZaria's eyes sharped as the three snakes shot out. Like eels swmming in the air though zig zagging in unusual ways. They didn't see to hold any care for a physical obstacle as they lashed out one aiming for each of them. A dark curse not meant to kill... but to make one understand true suffering. One that could make a man rethink their life, to wake up every night in a cold sweat, or to even drive themselves from the sheer horror it exposed them to to want to take their own life to escape such suffering.","timestamp":"2024-04-30T03:58:23.166000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":19,"userName":"hanarei"},{"id":"1237249530659999744","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Magic. Concentrated will of a user’s mind made manifest. Despite intent, such a thing often has a will of its own that far exceeds the act of its master. In this instance, even one as skilled as Zaria would underestimate the effect such a dense infliction would have on its subjects.\n\nAs the serpents lashed out against their prey, they made short work of any conjured resistance that Zi or James could muster. The intangible forms they possessed passed through James’s steel and screech of oblivion reached into his body. In whole the snake was swallowed within James’s form, mixing into his mind, while Zi met a fate similar.\n\nThe distant cracks of his soul flooded with darkness, staining and already muddy sheet blacker and blacker. Within his mind James cried out for mercy as an endless flood of thoughts consumed him until his vision faded away and he lost sight of his personality. Whatever he had stood for, whatever he had fought to protect sunk lower and further until all that was left was an ocean of desire for peaceful release.\n\n---\n\nThe damn cold air relentlessly cut against my feathers. No matter what in the universe would try to stop me, I was not going to give up. \n\nFaster, I pressed harder against the branches, lifting my wings to guide me further and faster through the air. The lines of mana thickened as I could almost see Zi and James in the distance. The thick fog constantly obscured my vision.\n\nAs I crossed the threshold, I appeared in range of both of them. But I was too late.","timestamp":"2024-05-07T03:47:55.094000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":20,"userName":"kyroscript"},{"id":"1237249538318798909","channel_id":"1169107547899318293","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Unbeknownst to me as the reason, Zi laid dead on the ground. His head had been severed by his own blade and body lay lifeless on the ground.\n\nIn a panic I reached out to find James, praying that his heart still rang. Though my prayers were answered, a part of me wishes I wouldn’t have found him.\n\nI’ll never forget James’s face. I could barely recognize him were it not for the clothing he was wearing. Whatever abyss of pain he had felt consumed even his form. Dying his hair silver and rippling his face. His mind consumed, tears rained from sorrow, while arms shook vigorously from whatever immense suffering ravaged his form. \n\nSlowly he raised his pistol to his head and took aim. If there was any strength of will left, it was powerless within a drown ocean that had succumb to despair. And soon a chorus of screams united. \n\n“JAMES!”\n\nI couldn’t hear my own voice. It had become so overpowered by the shockwave of the shot. While the ringing echoes gave way into silence, the closed curtains guided his body to the ground and left him lifeless.\n\nNo more.....the weight of despair overcame me and I fell to the ground. The final harbinger of truth turned to me. Its ravenous movement curled around me, slowly cutting off my oxygen. The light went out within, and I felt the slithering demon enter me.\n\nIn the emptiness I cried out for an answer. “Why! Whats the point of living?! If there is so much sadness and pain?”\nAs if to answer my prayers, my vision filled with light. I could see it, countless worlds across the sky, endless time brought about endless rise to civilizations across the universe. So many lives, a sea of souls. The warmth of a collective life filled me with joy, to see we were not alone. That was the reason to live, to see all the others that existed, to learn of their reasons for life.\n\nBut such joy was fleeting. As I watched time passed for the civilizations. Some fell to war, others fell to time, still others lost their reason to live. One by one each life ended and rose again to end. As more and more time passed, I could see the truth, this was an endless cycle of life and death. No one could escape, no one could become powerful enough to change their fate, there was no hope and eventually all things were slated to end…..\n\nThe only true way to end this, to bring peace to all things…was to end all life. To take everything into the eternal peace of slumber.\n\nMy eyes returned to me, and the despair consumed my body. The feathers on the outer edges stained black and mana of the void took hold over me. Consuming and changing my form to reflect my thoughts.\n\nMy gaze turned to her. “Mircle Priestess….save us.”","timestamp":"2024-05-07T03:47:56.920000+00:00","edited_timestamp":"2024-05-07T03:49:37.120000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":21,"userName":"kyroscript"},{"id":"1237263878635913216","channel_id":"1169107547899318293","author":{"id":"212762756271570945","username":"hanarei","avatar":"b4ec551b8ded8fb3122be58eb9a179b2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hanarei","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Zaria's eyes stared coldly at the men... though no... perhaps such a description was ill apt. It wasn't a lack of empathy, it was as if she gazing past them. Her very emotions projected on a plane beyond what most could perceive. Their expressions, their actions, it was all taken in as she simply looked on.\n\nIt wasn't ambivalence, but that of concern. A worried mother watching her treasured 'children' struggling yet unable to do anything but forced to watch them go through their own trials. All she did was 'bless' them with what knowledge they lack, the truth that their own blissful ignorance was having them so foolishly reject.\n\nHer footsteps clicked on the ground as she approached as if the very ground, she stepped on was marble. It was almost soothing as it was haunting. The 'static' that was the horrors her curse inflicted almost seeming to fade away as if she was some divine deity approaching. The horrors still lingered yet it was as if she was in some part soothing it. Dulling the shadow that encroached the mind. \n\nShe stared down towards you, resting now upon your knees looking upon her with such distant eyes. The words slipping free from your lips as she smiled warmly. The clicking of heels echoing out once more as she approached the void sitting behind her in such a distorted vision. Her hand slowly lifted to gently trace along your head brushing through it.\n\n\"It is all right... I shall give you that salvation... simply embrace such truths... for with it and my guidance you are sure to find the right path... to transcend the abyss.\" \n\nShe spoke her voice lofty as she took hold of you, gently pressing them into her warm embrace like that of a mother holding her child. Your face pressed within her bosom as if to offer salvation clearing away the horrors lurking within the mind, only escapable being within her hold.","timestamp":"2024-05-07T04:44:55.918000+00:00","edited_timestamp":"2024-05-07T05:06:26.563000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":22,"userName":"hanarei"}]