[{"id":"1232474874191024128","channel_id":"1161822880779227346","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Archives of Speculation:**\n\nPathfinder Report 776: Conduct of Aero.\nSiro Hiroden(MIA)\nLithos, Visuden.\n\nAs a summary of my previous reports, we received an anonymous message that the Selhorn family and the Zeiraam empire traded information for a large sum of Orcobras crystals. \n\nDue to the lack of validity of this claim I was the only pathfinder sent. \nSince I was unable to gain access to Zeiraam, I was forced to search Lithos for information regarding their trade. Apparently, as I discovered, the general public was unaware of the existence of this trade at all. \n\nAccording to the restrictions of a pathfinder, I am unable to proceed any further into this investigation. Despite this I have endeavored to pursue this outside of my responsibilities.\n\nAccording to eyewitness, there was a time where the leaders of the Selhorn family left Lithos, which in itself is fairly unusual due to the health of Coral. It seems her daughter Phoe left in her place, despite her age. \nThis led me to believe whatever knowledge they had was stored somewhere within the Selhorn mansion. Given my abilities I should be able to enter fairly easily and attempt to extract the knowledge.\n\nAll pathfinders are equipped with one emergency mental inscription, although not required, it is often used before ones final moments. It guarantees one final message will be sent no matter the location. Due to the message being created from a mental psyche in an instant, it’s often incomplete. I doubt this will be the case, but should I require it, I will use this final method.\n\n*Emergency Mental inscription.*\nPathinder Hiroden\n\nFear Fear Fear Fear.. Aero.. alterative… mana.. conversion…. Harmony… symbiotic relationship….tree….convert….aero….mana….fear fear fear….disruption….faith…people…theory…glass ocean….node….clog….nullify death….fear...pain pain pain….\nEnd inscription…","timestamp":"2024-04-23T23:35:08.283000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kyroscript"},{"id":"1167640143562293308","channel_id":"1161822880779227346","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Raw Orcobras:**\n\nA crystal resource that has been around on the surface of Melicau for time immemorial and whose existence extends beyond the planet itself. Massive veins of this resource are found in cavern that reach deep into the ground and are still discovered to this day.  Visuden’s city was founded on one such vein, however due to the plentiful nature and dangers of mining in the spring months, the mine was abandoned out of lack of necessity. \n\nIts useful property makes it common among certain societies like Visuden, however due to the inability to make more of it and the volatile nature, many societies people have moved away from it as a keystone resource, or avoided it all together.\nRaw Orcobras is very unstable. If enough mana is presented it will activate the crystal and rapidly consume an element around it until its full, then the crystal will expend that element all at once. \nHowever the catalyst for this activation depends on the side of the combined crystal, so large veins of the crystal would require an incredible amount of energy to kickstart the whole mine. Smaller crystals are quite aggressive however, but don’t have a large mana pool.\n\nOver time the amount of elements that can be store in a Orcobras crystal has increased as more were discovered to be compatible with its storage.\nThe current elements which can be stored within an Orcobras crystal are as follows: Earth, Fire, Air, Water, Ice, Lighting, Light, Shadow.\n\n**Refined Orcobras:**\n\nPrimarily used by Visuden technology, the refined version is far more stable. These crystals and be set to consume or release at any time and are charged much slower and safer. In essence a battery, that can hold element energy instead of power.","timestamp":"2023-10-28T01:45:03.930000+00:00","edited_timestamp":"2023-10-28T01:45:24.453000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kyroscript"},{"id":"1166658911965810739","channel_id":"1161822880779227346","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The current Empire is governed by two main powers; the **Eternal Sun of the Empire, the Emperor Albrecht Zeiraam the Second**, and the **Vigilant Moon of the Empire, the Grand Archmagus Morgan**. Though recovered from the brink of extinction, the Empire remains a far cry from its prime, lost magitech still being uncovered by the Empire daily. \n\nDespite this, the Empire still holds catastrophic power, and some fear of a second great multiversal crusade.","timestamp":"2023-10-25T08:46:00.087000+00:00","edited_timestamp":"2023-10-25T08:46:48.508000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"losthaven"},{"id":"1166658908211904544","channel_id":"1161822880779227346","author":{"id":"282635253875736576","username":"losthaven","avatar":"a_30b30e74057a69660e928e789aa847a6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"LostHaven","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**On the Zeiraam Empire**\n\nA monolithic colossus of multiversal polity, the Zeiraam Empire has stood an aeon, an eternal and titanic testament to humankind’s tenacity, resourcefulness and genius. Originating from a homeworld now lost to time, the Empire begun as a nexus of magic, the heart of all things mystical and arcane; the Magic Empire Zeiraam. Due to their deep origins with magic and the arcane, the Empire holds an intense disdain for a multitude of non-human races, but especially so against other races that hold an innate affinity of magic - for their ‘gifts’ are nothing more but sacreligious, an insult to the cores and beliefs the Empire was founded upon. \n\nIts discovery and invention of magitech lead the Empire to a rapid industrial revolution that quickly pushed them into the ascending to among the most advanced civilizations amongst the multiverse. Due to their deep origins with magic and the arcane, the Empire holds an intense disdain for a multitude of non-human races, but especially so against other races that hold an innate affinity of magic - for their ‘gifts’ are nothing more but sacreligious, an insult to the cores and beliefs the Empire was founded upon. It is known that in an age long past, at the absolute height of the Empire’s power, the legendary Emperor Andreas Detlev Zeiraam lead the Empire in a glorious crusade to achieve complete domination over the known multiverse. However, in a grave setback to the Zeiraam Empire’s righteous and glorious cause, the Grand Archmagus betrayed the Empire, and almost wrought forth its annihilation.","timestamp":"2023-10-25T08:45:59.192000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"losthaven"},{"id":"1163178019863674930","channel_id":"1161822880779227346","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**Around 80 years ago:**\n\nRays of sun passed through a crystal form. As it did, the light separated like a prism, on the shadow of its figure each shade of differences that made up a single ray was shown. \nImmaculate as the light was, when it passed through her body she remembered the loss of her mortality. She had no lungs to exhale with, no nervous system to feel she was in pain, no brain to create the chemical to tell her something was wrong, and no liquid to cry, but deep in the recesses of her soul she felt suffocated. \n\nWithin the distance she could see Eldor, slowly fading away into the horizon. The shining water of the sea grew larger as it filled the gaps in between her and the place she once called home.\nAfter a moment a black creature jumped onto the wood railing at the edge of the boat.\n\n“Sorry for taking this roundabout method. The captain is a friend of mine, so he won’t speak about either of our odd forms. But you will have to keep out of sight in the future. At least until we can find her. We should give you a name for now…hmmm….How about Crystalie?”\n\nThe creature spoke as though it was natural. She simply nodded. There was no way to for her to answer without lungs, or without a mouth.\n\n“Alright, I’ll be your mentor again. Let’s fill in the gaps of memory that happened when you were out. The history of Eldor! “\n\n**On Eldor Kings fall:**\n\nTo know the story of Eldor and Visuden, one must first know the religion of the “Tree of Fate.” In summary, there was a tree with immense power. It controlled the fates and minds of all its followers. In time, some believed it better to make their own fate, and so they cut down the tree and burned it forever. Freeing the followers of the tree to their own fate. \n\nVisuden sides with those who cut the tree down, while Eldor sides with the tree itself. Believing that true freedom is the ability to not have to think.\nThe Eldorian government has controlled its people for centuries with these believes. \n\nAbout One hundred years ago, one King, Irodawn, believed to free the people of Eldor from this ideology. But on the night of his coronation, he was assassinated by a group of fanatics. He and his wife, the soon to be Queen, were both murdered within the house. Their daughter Vila escaped and was evacuated to Visuden. \n\nAfter some time Vila was adopted into the Selhorn family, the leading family in control of Visuden, and many years later her daughter Coral would lead the house entirely. \nBecause of this, tensions have continued to rise between Eldor and Visuden. Visuden’s military has always surpassed Eldor’s and the threat of other countries of extreme power getting involved has kept the peace thus far.","timestamp":"2023-10-15T18:14:10.738000+00:00","edited_timestamp":"2023-10-15T18:54:18.383000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kyroscript"},{"id":"1163170560847659119","channel_id":"1161822880779227346","author":{"id":"108757318849531904","username":"reinhardt","avatar":"813677b2ff03227a8e1268244a07f228","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Reinhardt","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**THE EINHERJAR**\nFar in the ancient times, long before the rise of the great nations, a legendary mage bearing the name Aergundias had a fateful encounter with three beings that claimed to originate from a place too otherworldly, yet too familiar - which sounded almost like a different iteration of the world as it was. Whilst the encounter with such beings was on friendly terms, the revelation of the existence of such powerful beings brought forth a lingering thought in the mage's mind that would fester him until his end of days.\n\nFearing that, in the future, other beings from beyond would not be so benevolent as the visitors he encountered, the mage, with the knowledge imparted by the otherworldly visitors, used all his arcane expertise and his time crafting entities of incredible power - mortal vessels imbued with various essences of diverse origins and scale.\n\nThese entities, dubbed by the mage as The Einherjar, were placed in stasis, and were only supposed to be released during a time when the world was in dire need of their might. Unfortunately, at Aergundias's final moment, the festering thoughts that lingered within his mind pushed him over the brink of sanity - unleashing the seal he once placed, and setting such entities free to roam the lands.\n\nBased on the translated text of the Records of Aergundias, a collection of pieces written by the mage himself, there are currently three of these entities roaming the world. It is common speculation that there are five Einherjar scattered across the lands, whilst some scholars argue that the count is too low and could possibly reach double digits.","timestamp":"2023-10-15T17:44:32.370000+00:00","edited_timestamp":"2023-10-15T17:45:00.564000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"reinhardt"},{"id":"1162938121323819058","channel_id":"1161822880779227346","author":{"id":"279676443200585728","username":"kufufu.","avatar":"a8a96c03f34ba2eb6c1ef6064ab24dbd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kufufu","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"***The Fall of the City of Gnome***\nIn the shadowed annals of Gnomish lore, there stands a chronicle of unrelenting darkness—the fall of Gnome, a saga eternally etched in sorrow. Once, the proud city, with its great pointed spires and mechanical wonders, stood as a testament to Gnomish ingenuity.\n\nBut the Carbon Empire, an insidious force, descended upon Gnome with a voracious hunger. Their armies, clad in blackened steel, besieged the city without remorse. In those days, the clash of weapons, the anguished cries of the Gnomes, and the acrid scent of death hung heavy in the air.\n\nGnome's defenders, brave but outnumbered, fought desperately in the labyrinthine streets, their hammers striking against the obsidian armor of the invaders. Despite their valor, the city's defenses succumbed. Walls crumbled, homes burned, and the Gnomish way of life was obliterated. Their tall pointed hats hang at half mast in sorrow.\n\nIn the end, Gnome fell, the once-vibrant spirtual heart of a people, silenced. The Gnomes, a broken people, scattered to the winds to avoid the baldes of their enemies, their spirits crushed beneath the weight of all they had lost.","timestamp":"2023-10-15T02:20:54.469000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kufufu."},{"id":"1162930835796799600","channel_id":"1161822880779227346","author":{"id":"198327629047267328","username":"alteras","avatar":"a1dca50d42fb3590de37e118c021b985","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Alteras","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE PATHFINDER CORP, GUILD OF HEROES**\n\nIn the Guild's early days, quests were usually limited to rumors or whether commoners could reach the front desk fast enough. This wasn't an issue at the beginning, as the guild only had so much manpower in the chaotic days of old. But as the guild grew with more members and influence, so too did misinformation, fraud, and lack of trust around various quest givers. Quests started to report mismatching information and rewards due to a variety of reasons: commoner lack of knowledge, greedy merchants, villainous individuals, and even just no one being in the area to confirm. The Guild attempted to mitigate this through an informal system of familiars, tools, and magic, but it wasn't enough. The Wolford Stars Incident and subsequent Twilight Battle of Wolford forced the Guild to acknowledge the their lack of information gathering and processing capabilities. As such, the Pathfinder Corp was established.\n\nThe Pathfinder Corp was formed to cover the roles of intelligence gathering, quest verification, and regular scouting duties, however has since expanded to include exploring regions where guild members, and people in general, don't usually reach. Acting as the Guild's eyes and ears on the ground, pathfinders explore areas where the Guild can't through conventional means, gathering accurate information about possible quests and threats. They also act as a psuedo intelligence network in conjunction with various mercantile guilds.\n\nPathfinders exist within the same hierarchy of the Guild, but are afforded more privileges and trust in exchange for stricter requirements and duties. In essence, they act as mobile guild staff, able to officiate in matters corresponding to their rank. They also carry specialized items including observation tools, priority communication tools, and evacuation equipment. At minimum pathfinders must be able to fight and survive long enough to deliver information back to the Guild. Usually they will stay onsite to act as guides or informants for guild members who follow. There are also pathfinders who specialize in espionage activities, gathering information on nations and organizations hostile to the guild. But most pathfinders explore less traveled and unknown regions.\n\nFor guild members, they are the guides and quest givers. For hostile forces, they are the encroaching signs of unwanted interlopers. But for the many who despair, they are first signs of hope, the hope that the Heroes will come.","timestamp":"2023-10-15T01:51:57.464000+00:00","edited_timestamp":"2023-10-15T01:52:27.014000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"alteras"},{"id":"1162795784039825519","channel_id":"1161822880779227346","author":{"id":"416005934410891274","username":"oliviatpines","avatar":"fe5db61498b4c18482afc955dfe36275","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Olivia T Pines","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE RANTIAN DEPTHS**\n\nThe Rantian people are a society well known but nowhere even approaching well thought of, consisting racially of any species who are willing to challenge themselves to live and thrive in their society built on and (far more importantly) under a single mountain.\n\nRantian's are... brutal. Every single person from a random farmer to the King or Queen of Rantia got precisely where they are by killing every person between their previous position in society and the new position they have earned, deeper in the depths of their mountain's mined out homes.\n\nThe reason this practice has not been brutally snuffed out by the rest of the world is twofold.\n\nReason One: They are extremely insular, once a member of Rantian society you almost never leave, and they do not wage war unless assaulted first.\n\nReason Two: Nobody wishes to risk causing a Rantian Ruler, a verifiable Monarch Of Murder to ever have reason to leave. Whether they earned their throne through Magical combat to shatter planar barriers with ease, Martial weight to shift countries or Duplicitous means such that none know how it even occurred, nobody wishes to face these constantly disputed absolute grandmasters of their violent crafts.\n\n\nFor context, the deeper in the mountain you live, the better your position in society and thus the more powerful you MUST be to live there. It's not uncommon for Young Dragon's to live near the upper levels of the above ground portion of the mountain.","timestamp":"2023-10-14T16:55:18.616000+00:00","edited_timestamp":"2023-10-14T16:58:47.457000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"oliviatpines"},{"id":"1162792121355477103","channel_id":"1161822880779227346","author":{"id":"179260464956440576","username":"gabbie0w0","avatar":"733fb651107eec3a4a024a017c0d3186","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Gabbie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE CRIMSON LEGIONS**\n\nThe Crimson Legions ~~are~~ were a group of evil-aligned adventurers, mages, warriors et al., who were aligned by their common hatred for the Kingdom of Albion. Their base of operations ~~is~~ used to be Castle Black, an ancient magical fortress on the border between Rivannes and Albion. Its leader was and still remains unknown, although some conspiracy theorists claim that the Crimson Legions were orchestrated by the Albionian Secret Services to cause a war and deal with overpopulation, or something...\n\nStructure wise, they resembled a private military group, like mercenaries, although they are also for hire for the right price. They used to number in the tens of thousands, if not significantly more, but ermnants of the Crimson Legions now number in the low thousands, scattered around Melicau. Their \"official\" end was sanctioned by their defeat on the Fields of Wandre during the Winding War, at the hands of August Albinchyr III.","timestamp":"2023-10-14T16:40:45.364000+00:00","edited_timestamp":"2023-10-14T16:42:49.968000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"gabbie0w0"},{"id":"1162790530393047140","channel_id":"1161822880779227346","author":{"id":"538347054359904273","username":"questionable7393","avatar":"a08858dd27e13d08a8957abc091d6043","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"questionable","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE ORDER OF OUR ENSILVERED MAIDEN**\n\nThe Esteemed Gathering In the Name of Our Gracious and Divine Ensilvered Maiden, or just the Order of Silver colloquially, is an organization originating from Albion steeped in tradition and wreathed in an ancient history.\n\nAs the story goes, aGoddess long forgotten only remembered as the Maiden, came to the old people of Albion and spoke of them about the undeniable and immutable greatness of Humanity. With her blessing the humans of Albion came to supremacy against the tides of evil that doomed them. Simply put, the Order teaches a dogma of an Absolute Anthropic principle. \n\nHumanity are the true inheritors of the world, do not suffer the injustice of the evil inhuman. \n\nIn recent centuries, due to the cosmopolitan nature of the world and the influence of the Guild of Heroes, the Order has lost all of it's public appeal and retreated into operating underground, supported by a core group of nobles entrenched in the Albionite government. \n\nThough, every once in a while, rumours of their activities still surface. \n\nPurging of witch covens, eradication of beast men packs in the borders of the country. Etc.","timestamp":"2023-10-14T16:34:26.049000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"questionable7393"},{"id":"1162591279444664360","channel_id":"1161822880779227346","author":{"id":"307753079242227712","username":"snowtwo","avatar":"40ebca2985042734e11ca52b78450f7a","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Snowtwo","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"The Goddess Fortuna: The Goddess Fortuna is a generally loved and beloved goddess whom brings good luck to those who follow her. She is known for encouraging people to engage in bold feats, making their own way in life, and taking on risky endeavors though not blindly. Those who acknowledge risk and try to prepare for it will be blessed by her while those who act in ignorance of risk, dismiss it entirely, or willingly tempt fate will be shunned. She is known to be particuarly active though indirect with her good luck tending to shine down upon merchants, explorers, adventurers, and the like. The fact that many an adventurer have not ended up roasted by a dragon or something on their first adventure is often seen as a sign of her favor and the many close scrapes and near-deaths where certain demise was averted by good fortune at the last moment are treated as further signs of her blessing. She's also known to withdraw her luck from malicious actors which may be why heroes always seem to find the villains weakness or narrowly avoid demise.\n\nSome say that Fortuna is only her last name, but even if this is true, none know her first name making the distinction irrelevant. Offerings of coin are seen as the preferred offering, though alternatives in the form of goods to improve a region/people/etc, thusly making it wealthier and more viable are considered acceptable. If it helps the economy and isn't something like slave labor Fortuna likely approves of it.","timestamp":"2023-10-14T03:22:40.921000+00:00","edited_timestamp":"2023-10-14T05:15:40.945000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"snowtwo"},{"id":"1162437331895189604","channel_id":"1161822880779227346","author":{"id":"700884146582585396","username":"lealope","avatar":"74543b907a9f0cc730b5e179d00aa166","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Lealope","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE HEAVENS**\n\nBeyond the world lies the Empyrean Sea, the dwelling place of all the greatest gods. These gods have their own pantheons and peoples, and struggles, but tend to agglomerate around certain thematics, often correspondent to the celestial body upon which they reside. Their waxing and waning tends to influence, or perhaps be influenced by, the deeds of the mortal world.\n\nShould their influence be particularly strong in a given region, the material plane might see signs in the heavens of their presence. There are disciplines built around the reading of these portents, and their interpretation has meant the rise and fall of empires and lesser deities.","timestamp":"2023-10-13T17:10:56.965000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"lealope"},{"id":"1162417057573388429","channel_id":"1161822880779227346","author":{"id":"183649955871719424","username":"noblescion","avatar":"6ae28f686d6978a93bbabf388dfd9ffe","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"Cascaesque","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON THE GLASS OCEAN**\n\nThe glass ocean is a large territory of irreperably broken magic items, shattered magical gems, and many a dead adventurer.\n\nOnce a large vein of magical energy, it was commandeered by creatures that soon grew to monstrous size and strength, countless better and better-equipped adventurers losing their lives and equipment to the magic-devouring creatures there.\n\nOver several centuries, the decaying adventurers left behind imperishable equipment only to be trampled over and broken, yet luring in more enthusiastic heroes eager to claim both the vein and the numerous amounts of potentially valuable equipment.\n\nThough most have since given up on the feat, instead using it as a drop-off point for useless equipment since it is outside the boundaries of any pollution/disposal laws, adding to its size with snapped staves and corroded swords.\n\nA giant, sparkling ocean of metal, monsters, and shards, with mana thick in the air.","timestamp":"2023-10-13T15:50:23.190000+00:00","edited_timestamp":"2023-10-13T15:51:19.668000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"noblescion"},{"id":"1162079720737882243","channel_id":"1161822880779227346","author":{"id":"416005934410891274","username":"oliviatpines","avatar":"fe5db61498b4c18482afc955dfe36275","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Olivia T Pines","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"At the floor of the ocean, in the middle of a whirlpool which appears at random once every one hundred years for a mere five minutes there is a dome, within this dome there is a Mirror, whoever looks into this Mirror and acknowledges every evil deed and good accomplishment shall be gifted a bottle with a single drop of blood in it. Any who consume this droplet shall immediately be cured of any ailment, be it of Mind, Body or Soul.","timestamp":"2023-10-12T17:29:55.821000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"oliviatpines"},{"id":"1162079121640259604","channel_id":"1161822880779227346","author":{"id":"179260464956440576","username":"gabbie0w0","avatar":"733fb651107eec3a4a024a017c0d3186","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"Gabbie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON YITALIA**\n\nYitalia is a nation bordering Espania on its southern border, about the size of real-life Italy. There, everyone is a practitioner of the Yitalian Forms of Perfection, a magic system based around weirdly-accented noises and odd hand-gestures which channel magical power into enhancing one's mundane skills and more. By channeling this energy via spells, the user slowly enhances themselves in a permanent fashion - as such, almost all Yitalians tend to live well into their hundreds, only starting to visibly age past twenty only when in their seventies, and anyone above the age of eighty-five is a paragon of skill, and a beacon of inspiration in all human endeavors.\n\nOne of the most renowned magic systems is the Yitalian Forms of Culinary Supremacy, which is a sub-form of the Forms of Perfection that channels the magical power not into oneself, but into deliciously-cooked food. As a result, consuming these Supreme Foods has immense benefits for their consumers - the benefits and the powers granted by these foods scale in potency with the complexity of the recipe. As this tends to concentrate more power into a smaller format, the abilities and benefits granted are stronger than those of the Forms of Perfection, but also more volatile and unfortunately temporary.\n\nOnly one Gordeau Rohzi, a Yitalo-Albionian Culinary Supremacist of great skill, has mixed Albionian and Yitalian cuisine, creating the Heretical Forms. He was deemed both a revolutionary and a madman, as many Yitalians deem the mixing of foreign culinary traditions as 'unforgivable taint.' The main upside of the Heretical Forms is that the benefits granted, while wilder and more unpredictable - some going as far as carrying negative mutations or irreparable mental contaminations - are insanely more powerful and also permanent.","timestamp":"2023-10-12T17:27:32.985000+00:00","edited_timestamp":"2023-10-12T17:37:59.352000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"gabbie0w0"},{"id":"1161830907842404412","channel_id":"1161822880779227346","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**ON GNOMES**\n```The Carbon Emperor of the Zeiraam Empire demands a thousand gnome souls every day as sacrifices. Gnomes are persecuted, repressed and exterminated en masse.```\n```Zeiraamite phrenologists catch gnomes attempting to pass through checkpoints while dressed in trenchcoats every day.```\n```All gnomes across the multiverse are in a great exodus of escaping from the Empire and trying to reach the Pygmalian Domain, where the Gnome King can safeguard them.\n```","timestamp":"2023-10-12T01:01:14.204000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"birdsie"},{"id":"1161823332207968327","channel_id":"1161822880779227346","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"","timestamp":"2023-10-12T00:31:08.032000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":6,"message_reference":{"type":0,"channel_id":"1161822880779227346","message_id":"1161823290462044180"},"flags":0,"components":[],"position":0,"userName":"birdsie"},{"id":"1161823290462044180","channel_id":"1161822880779227346","author":{"id":"278232508473278464","username":"birdsie","avatar":"62b5d304a6ec1b55799c019c3a785302","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Birdsie","avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"**FOR WORLDBUILDING STORAGE**\n\nDown here, you can drop any ideas or suggestions you have for the setting.\n\nFor now, the planet's name is Melicau, and its cousin is Alheria. The Zeiraam Empire exists, a monolithic colossus of a multiversal polity most of which thankfully avoid tangling in Melicauian affairs. And on it, the Kingdom of Albion reigns as the chief seat of the Guild of Heroes, its most powerful organization.","timestamp":"2023-10-12T00:30:58.079000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":true,"type":0,"flags":0,"components":[],"userName":"birdsie"}]