[{"id":"1163991175670280294","channel_id":"1163201948439293982","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Fairfax Mountains","timestamp":"2023-10-18T00:05:22.190000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1163991175670280294","guild_id":"796570401681309696"},"flags":32,"thread":{"id":"1163991175670280294","type":11,"last_message_id":"1165141431145480212","flags":0,"guild_id":"796570401681309696","name":"Fairfax Mountains","parent_id":"1163201948439293982","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"214058147499868160","thread_metadata":{"archived":true,"archive_timestamp":"2023-11-20T04:19:18.872000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2023-10-18T00:05:22.190000+00:00"},"message_count":2,"member_count":3,"total_message_sent":3,"member_ids_preview":["214058147499868160","198327629047267328","340862894998683658"]},"components":[],"position":0,"userName":"kyroscript"},{"id":"1163991178404962304","channel_id":"1163991175670280294","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Long after the cinders of the Culters explosion had gone out, another cataclysm took hold of the now thirty two remaining lives of the inhabitants of the that were once sheltered in the mechanisms of the vehicle. \n\nAs night began to fall, the unbearable cold ripped from them what life remained as they desperately searched for an escape. In the desperation a leader was in need, someone to bring the people together or they would join their brethren in sleeping eternally within the white sheets.\n\nKaltron rose up. One of the noblemen who had fought so adamantly against his countries actions, were he to perish here, such struggles would have been in vain.\n\nWith little time left, Kaltron had people run over the salvage to find supplies and anyone still living, several were on the bring of death, but were able to walk.\n\nThe rest of the group has been tasked to look for anything to shelter them. This in itself had been the saving grace, near the desolation there was a large pocket within the rock. With little time they made their way into the cave.\n\nThey had clothing, blankets, and small amounts of food. But they would be dead within a day a best. No doubt the Visuden military would attempt to rescue them, but no one here could even build a fire. It was going to be too little too late.\n\nKaltron condensed his body. This wasn’t the intention, not to die here.","timestamp":"2023-10-18T00:05:22.842000+00:00","edited_timestamp":"2023-10-18T02:02:23.831000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"👍"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"type":0,"flags":0,"components":[],"userName":"kyroscript"},{"id":"1165141431145480212","channel_id":"1163991175670280294","author":{"id":"214058147499868160","username":"kyroscript","avatar":"8d00af5699209435f00ea5ac61a9e81b","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"banner_color":null,"clan":null},"content":"Salvation for the dwindling flame would come. Through the cave entrance, two came cloaked in robes. One of the figures touched Kaltron’s body, and from against the cave wall he stood again. Cold air rapidly escaped from his lungs.\n\n “Who are you?” he asked.\n\nOne of the figures lifted their cloak, from it her blue hair descended over her shoulder.  She and the other figure removed their backpacks and from within unloaded supplies of food and heavy clothing.\n“I am Simra, a traveler from a nearby village. We heard the echoes of an explosion and hurried as fast as we could. Please eat, my associate will create a fire.”\n\nShe looked to Kaltron.\n“Take me to your truly sick and I will attempt to heal them.” Kaltron nodded and other members of the survivors followed from trust in his prior actions. \n\nSimra’s companion created a fire to keep those warm, and food was passed out. As Simra followed Kaltron they passed over several people that were unresponsive. \nMany she touched and was able to bring life back to them, afterward giving them clothes to cover up their skin. \n\nThose that could still move, she would help over to the fire and feed them.\n\nAfter several hours a piercing scream of industry could be heard from the distance. As the survivors looked over a beam of light cut through the night. \nThe Visuden military had returned. Just beyond the destroyed train, another could be seen.\n\nThe survivors rushed to the aid of the Visuden, and while the train unloaded men and women ready to assist, Behemoth was not among them.\nSimra smiled, walking with the survivors. Beneath her lips hummed a subtle lullaby.","timestamp":"2023-10-21T04:16:04.466000+00:00","edited_timestamp":"2023-10-21T04:16:48.956000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"kyroscript"}]